{
    "links": {
        "self": "https://jobs.code4lib.org/jobs?page=1",
        "next": "https://jobs.code4lib.org/jobs?page=2",
        "last": "https://jobs.code4lib.org/jobs?page=362"
    },
    "data": [
        {
            "id": 57233,
            "attributes": {
                "title": "Technology and Communications Strategist  ",
                "origin": "https://jobs.code4lib.org/jobs",
                "url": "https://musc.career-pages.com/jobs/univ-open-rank-faculty-technology-and-communications-strategist-library-charleston-south-carolina-united-states",
                "description": "\u003cp\u003eThe Medical University of South Carolina Libraries invites applications for the Technology and Communications Strategist position for Region 2, Network of the National Library of Medicine.\u0026nbsp;\u0026nbsp;\u003c/p\u003e\u003cp\u003eFunded by the National Library of Medicine (NLM) through a cooperative agreement (2021-2026), MUSC serves as the headquarters for Region 2, one of seven regions in the NNLM Program.  Region 2 comprises Alabama, Florida, Georgia, Mississippi, South Carolina, Tennessee, the Commonwealth of Puerto Rico, and the U.S. Virgin Islands. The mission of the NNLM is to advance the progress of medicine and improve the public\u0026#39;s health by providing U.S. researchers, health professionals, the public health workforce, educators, and the public with equal access to biomedical and health information resources and data. \u0026nbsp;\u0026nbsp;\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eGeneral Duties:\u0026nbsp;\u003c/strong\u003eUnder the general direction of the Executive Director (ED), the Technology and Communications Strategist assumes leadership in promoting the use and integration of digital tools into Region 2 activities for the region. This position also serves as the DOCLINE Coordinator. An ALA-accredited graduate degree or an advanced degree in another discipline is required.\u0026nbsp;\u0026nbsp;\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eFor More Information:\u0026nbsp;\u0026nbsp;\u003c/strong\u003eReview of applications will begin May 10, 2023, and continue until the position is filled. Required and Preferred qualifications, application procedures, and other information are available in the complete \u003ca target=\"_blank\" href=\"https://musc.career-pages.com/jobs/univ-open-rank-faculty-technology-and-communications-strategist-library-charleston-south-carolina-united-states\"\u003eposition description.\u003c/a\u003e\u0026nbsp;\u003c/p\u003e\u003cp\u003eThe Medical University of South Carolina is an Equal Opportunity/Affirmative Action Employer. Women, minorities, and persons with disabilities are encouraged to apply.\u0026nbsp;\u003c/p\u003e",
                "job_type": "full_time",
                "telecommute": false,
                "location": "Charleston, SC",
                "contact": "Ms. Shannon D. Jones, EdD, MLS, M.Ed, AHIP, FMLA \r\nDirector of Libraries \u0026 Professor \r\nMedical University of South Carolina \r\nDirector, Region 2, NNLM \r\n171 Ashley Avenue, Suite 415, MSC 403  \r\nCharleston, South Carolina 29425-4030 \r\n843-792-8839 | joneshan@musc.edu ",
                "published": true,
                "created_at": "2023-04-27T19:44:07.793Z",
                "updated_at": "2023-04-28T17:27:40.163Z",
                "published_at": "2023-04-28T17:27:40.162Z"
            },
            "relationships": {
                "employer": {
                    "links": {
                        "self": "https://jobs.code4lib.org/employers/medical-university-of-south-carolina"
                    },
                    "data": {
                        "id": 927,
                        "name": "Medical University of South Carolina"
                    }
                }
            },
            "links": {
                "self": "https://jobs.code4lib.org/jobs/57233-technology-and-communications-strategist"
            }
        },
        {
            "id": 57228,
            "attributes": {
                "title": "Internship in Honor of Melvin Ember 2023-2024",
                "origin": "https://jobs.code4lib.org/jobs",
                "url": "https://hraf.yale.edu/hraf-internship-in-honor-of-melvin-ember-2023-2024/",
                "description": "\u003cp\u003eThe Human Relations Area Files (HRAF) at Yale University is pleased to announce a one-year internship in honor of Melvin Ember. \u003ca href=\"https://hraf.yale.edu/about/staff/melvin-ember/\"\u003eMelvin Ember\u003c/a\u003e was President of HRAF from 1987 until his death in 2009. The intent of the internship is to learn about cross-cultural research through practical experience. Some of the main tasks will be:\u003c/p\u003e\u003col\u003e\u003cli\u003ehelping Carol Ember prepare modules summarizing cross-cultural research\u003c/li\u003e\u003cli\u003ereading and analyzing recent cross-cultural research with the goal of summarizing materials for researchers in \u003ca href=\"http://hraf.yale.edu/ehc\"\u003eExplaining Human Culture\u003c/a\u003e\u003c/li\u003e\u003cli\u003eparticipating in on-going cross-cultural research projects\u003c/li\u003e\u003c/ol\u003e\u003cp\u003eThe internship will reimburse living expenses in the amount of $450 per week for approximately 50 weeks beginning late Summer 2023. Travel costs up to $900 will also be reimbursed for a move to and from New Haven. Hours are based on a 37.5 hour week.\u003c/p\u003e\u003cp\u003eAbout HRAF\u003c/p\u003e\u003cp\u003eFounded at Yale University, HRAF is an internationally recognized organization in the field of cultural anthropology. HRAF\u0026rsquo;s mission is to promote understanding of cultural diversity and commonality in the past and present. HRAF supports teaching and research through online applications and other resources with large curated online collections of annotated ethnographic and archaeological documents. HRAF researchers\u0026rsquo; projects include comparisons of different cultures from around the world identifying and testing theories about cultural diversity and change. Topics have ranged from intergroup conflict and resource vulnerability to integrative research relating cultural responses to climate-related natural hazards.\u003c/p\u003e\u003cp\u003eEligibility\u003c/p\u003e\u003cp\u003eInternship candidates must already have the right to work in the United States at the time of application and have (or will have) graduated from college by the beginning of the internship. Preference will be given to candidates with the following qualities:\u003c/p\u003e\u003col\u003e\u003cli\u003eplan on graduate study in anthropology or a closely related field (or have already started graduate school)\u003c/li\u003e\u003cli\u003eability to perform statistical analyses (with a minimum of one formal statistics course)\u003c/li\u003e\u003cli\u003ehave accomplished academic records particularly in their major field and/or anthropology courses\u003c/li\u003e\u003c/ol\u003e\u003cp\u003eHow to Apply\u003c/p\u003e\u003cp\u003eTo apply, complete \u003ca href=\"https://hraf.yale.edu/wp-content/uploads/2023/04/MelvinEmberInternship2023_Application.docx\"\u003e\u003cstrong\u003ethe application form here\u003c/strong\u003e\u003c/a\u003e and save it as \u0026ldquo;\u003cstrong\u003eInternship-2023-Lastname-Firstname\u003c/strong\u003e\u0026rdquo; in Word or .PDF format.\u003c/p\u003e\u003cul\u003e\u003cli\u003eEmail your application with the subject line \u0026ldquo;Melvin Ember Internship\u0026rdquo; to \u003ca href=\"mailto:carol.ember@yale.edu\"\u003eCarol R. Ember\u003c/a\u003e (carol.ember@yale.edu) with a copy to hraf@yale.edu.\u003c/li\u003e\u003cli\u003eDeadline is \u003cstrong\u003e11:59 PM EDT on May 5, 2023.\u003c/strong\u003e\u003c/li\u003e\u003cli\u003eYou should receive an acknowledgement of your application within a couple of days after submission..\u003c/li\u003e\u003c/ul\u003e\u003cp\u003eFurther information about HRAF and its activities is available \u003ca href=\"http://hraf.yale.edu\"\u003eon our homepage\u003c/a\u003e. Find out more \u003ca href=\"http://hraf.yale.edu/about/staff/melvin-ember/\"\u003eabout Melvin Ember\u003c/a\u003e.\u003c/p\u003e\u003cp\u003e\u0026nbsp;\u003c/p\u003e",
                "job_type": "full_time",
                "telecommute": false,
                "location": "New Haven, CT",
                "contact": "For general information: hraf@yale.edu\r\nFor applications: Carol.Ember@yale.edu",
                "published": true,
                "created_at": "2023-04-27T16:37:45.085Z",
                "updated_at": "2023-04-28T17:27:33.212Z",
                "published_at": "2023-04-28T17:27:33.211Z"
            },
            "relationships": {
                "employer": {
                    "links": {
                        "self": "https://jobs.code4lib.org/employers/hraf-at-yale-university"
                    },
                    "data": {
                        "id": 241474,
                        "name": "HRAF at Yale University"
                    }
                }
            },
            "links": {
                "self": "https://jobs.code4lib.org/jobs/57228-internship-in-honor-of-melvin-ember-2023-2024"
            }
        },
        {
            "id": 57227,
            "attributes": {
                "title": "Electronic Resources Librarian (Library Professional 1/2) ",
                "origin": "https://jobs.code4lib.org/jobs",
                "url": "https://lanl.jobs/search/jobdetails/electronic-resources-librarian-library-professional-12/3c0b958a-cd93-41c7-aeb4-618eb07ab565",
                "description": "\u003cp\u003eLos Alamos National Laboratory (LANL) is a multidisciplinary research institution engaged in science and engineering on behalf of national security. We are seeking an\u003cstrong\u003e Electronic Resources Librarian \u003c/strong\u003eto join The LANL Research Library in Los Alamos, NM. In this position, you will serve as an expert in the electronic resources lifecycle and find creative ways to maximize the impact of subscription and open access content to meet LANL\u0026#39;s mission of solving national security challenges through scientific excellence. \u003cstrong\u003eBased on experience, candidates will be hired at a level 1 or 2 position.\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eLibrary Professional 1 ($61,600 - $96,500)\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eLibrary Professional 2 ($75,100 - $119,200)\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e\u0026nbsp;\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eResponsibilities:\u003c/strong\u003e\u003c/p\u003e\u003cul\u003e\u003cli\u003eAssist in managing the life cycle of the library\u0026#39;s electronic resources, including databases, books and serials\u003c/li\u003e\u003cli\u003eActivate and maintain access protocols for electronic resources and collections, and update and customize metadata for electronic resource access\u003c/li\u003e\u003cli\u003eProactively assist in the management of technical and administrative changes related to electronic resource access\u003c/li\u003e\u003cli\u003eCollaborate with internal and external partners to ensure ongoing access to licensed electronic resources (e.g., publisher package entitlements, databases and other types of resources)\u003c/li\u003e\u003cli\u003eResolve problems arising from the use of electronic resources and respond to end-user reported issues with electronic resources\u003c/li\u003e\u003cli\u003eCommunicate promptly and professionally with library staff, users and vendor support to troubleshoot online access issues\u003c/li\u003e\u003cli\u003eManage the Ex Libris knowledge system(s) (Alma and Primo) to optimize the use of our electronic resources\u003c/li\u003e\u003cli\u003eCollect and manage usage statistics and prepare reports detailing changes related to the coverage, access and usage of electronic resources\u003c/li\u003e\u003cli\u003eEnsure access to and discoverability of resources via application of appropriate metadata\u003c/li\u003e\u003cli\u003eAssist in developing procedures for and documentation of e-resource management workflows and provide training on e-resources when needed\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e\u003cstrong\u003eCandidates at the Library Professional 2 level will also be required to:\u003c/strong\u003e\u003c/p\u003e\u003cul\u003e\u003cli\u003eBe responsible for maintaining and troubleshooting integration profiles and monitoring scheduled jobs that run in Alma\u003c/li\u003e\u003cli\u003eRecommend and help implement new approaches to electronic resource management, including end-user search interface options and tools to facilitate the delivery of information that supports research and learning\u003c/li\u003e\u003cli\u003eCustomize and troubleshoot implementation of new Alma and Primo features and suggest solutions to improve discovery, usability and/or e-resources workflows\u003c/li\u003e\u003cli\u003eUtilize emerging trends and best practices in electronic resource management to enhance library services\u003c/li\u003e\u003cli\u003eConduct and engage in projects designed to enhance and optimize user access to subscribed materials\u003c/li\u003e\u003cli\u003eDevelop and implement assessment strategies and conduct ongoing assessments\u003c/li\u003e\u003cli\u003eIdentify emerging educational technologies and research methods, open access trends, related e-resource and bibliographic standards, authentication, interoperability and other technical issues related to the acquisition, licensing, access, usage and data mining of electronic resources\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e\u003cstrong\u003eQualifications:\u003c/strong\u003e\u003c/p\u003e\u003cul\u003e\u003cli\u003eMaster\u0026rsquo;s degree in library and information science from an American Library Association accredited program\u003c/li\u003e\u003cli\u003e2+ years of experience (Level 1); 5+ years of experience (Level 2)\u003c/li\u003e\u003cli\u003eDemonstrated familiarity with common issues, workflows and tools related to e-resource access, use and management\u003c/li\u003e\u003cli\u003ePrevious experience with knowledge management systems, such as Ex Libris, Serials Solutions, etc., as well as Link resolvers\u003c/li\u003e\u003cli\u003eUnderstanding of the details of a cataloging record\u003c/li\u003e\u003cli\u003eWorking knowledge of LSP and common MARC record management systems, such as OCLC systems, Alma, etc.\u003c/li\u003e\u003cli\u003eUnderstanding of KBART or other title entitlement metadata, especially metadata pertaining to e-serials (e.g. title changes, coverage, etc.)\u003c/li\u003e\u003cli\u003eUnderstanding of central discovery index metadata and options\u003c/li\u003e\u003cli\u003eAbility to research and follow cataloging guidelines to enhance discoverability and access to resources, as well as metadata best practices\u003c/li\u003e\u003cli\u003eProven experience working on multiple projects and meeting deadlines\u003c/li\u003e\u003cli\u003eExperience effectively managing projects, engaging stakeholders, communicating progress, delegating responsibilities and adjusting plans as appropriate\u003c/li\u003e\u003cli\u003eKnowledge of authentication protocols and tools, as well as trends in authentication, such as IP authentication/proxy tools, SSO, SAML based authentication, authentication via federation options and tools, such as OpenAthens and Seamless Access\u003c/li\u003e\u003cli\u003eStrong communication, collaboration, problem solving and customer service skills\u003c/li\u003e\u003cli\u003eKnowledge of electronic resource industry standards, best practices and protocols, including ER Licensing, SUSHI, COUNTER, Project Transfer, common authentication protocols and OpenURL preferred\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e\u003cstrong\u003eWe Are Delivering Scientific Excellence \u003c/strong\u003e\u003c/p\u003e\u003cp\u003eLos Alamos National Laboratory is more than a place to work. It is a catalyst for discovery, innovation and achievement. Professional development, work/life balance and a diverse and inclusive team foster lasting career satisfaction. Our onsite medical and fitness facilities, education assistance and generous compensation and benefits reflect our commitment to providing our people with all they need for personal and professional growth.\u003cbr /\u003e\u0026nbsp;\u003c/p\u003e\u003cp\u003e\u003cem\u003eLos Alamos National Laboratory is an equal opportunity employer and supports a diverse and inclusive workforce. All employment practices are based on qualification and merit, without regards to race, color, national origin, ancestry, religion, age, sex, gender identity, sexual orientation or preference, marital status or spousal affiliation, physical or mental disability, medical conditions, pregnancy, status as a protected veteran, genetic information, or citizenship within the limits imposed by federal laws and regulations. The Laboratory is also committed to making our workplace accessible to individuals with disabilities and will provide reasonable accommodations, upon request, for individuals to participate in the application and hiring process. To request such an accommodation, please send an email to applyhelp@lanl.gov or call 1-505-665-4444 option 1.\u003c/em\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e\u0026nbsp;\u003c/strong\u003e\u003c/p\u003e",
                "job_type": "full_time",
                "telecommute": false,
                "location": "Los Alamos, New Mexico",
                "contact": "Staci Dawn Wilkes (staciw@lanl.gov)",
                "published": true,
                "created_at": "2023-04-27T15:41:48.232Z",
                "updated_at": "2023-04-28T17:27:15.658Z",
                "published_at": "2023-04-28T17:27:15.657Z"
            },
            "relationships": {
                "employer": {
                    "links": {
                        "self": "https://jobs.code4lib.org/employers/los-alamos-national-laboratory"
                    },
                    "data": {
                        "id": 1578,
                        "name": "Los Alamos National Laboratory"
                    }
                }
            },
            "links": {
                "self": "https://jobs.code4lib.org/jobs/57227-electronic-resources-librarian-library-professional-1-2"
            }
        },
        {
            "id": 57226,
            "attributes": {
                "title": "Applications Programmer/Analyst",
                "origin": "https://jobs.code4lib.org/jobs",
                "url": "https://careers.umich.edu/job_detail/233641/applications-programmeranalyst",
                "description": "\u003cp\u003e\u003cstrong\u003eJOB OPENING ID\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://careers.umich.edu/job_detail/233641/applications-programmeranalyst\"\u003e233641\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eWORKING TITLE\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eApplications Programmer/Analyst\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eJOB TITLE\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eApp Programmer/Analyst Inter\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eWORK LOCATION\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eAnn Arbor Campus\u003c/p\u003e\u003cp\u003eAnn Arbor, MI\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eFULL/PART TIME\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eFull-Time\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eREGULAR/TEMPORARY\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eRegular\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eFLSA STATUS\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eExempt\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eORGANIZATIONAL GROUP\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eUniv Library\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eDEPARTMENT\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eLibrary Info Tech-Dig Lib Apps\u003c/p\u003e\u003cp\u003e\u003cstrong\u003ePOSTING BEGIN/END DATE\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e4/24/2023 - 5/17/2023\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eSALARY\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e$68,000.00 - $83,000.00\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eCAREER INTEREST\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eInformation Technology\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eHow to Apply\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eApplications must include all of the following, in the order listed, to be considered. Due to system restrictions, the items must be submitted as a single document.\u003c/p\u003e\u003cul\u003e\u003cli\u003eA cover letter describing your interest in the position, your skills, and experience directly relevant to the work of the position\u003c/li\u003e\u003cli\u003eYour resume, with a link to a portfolio of your relevant work if possible\u003c/li\u003e\u003cli\u003eA list of three professional references, including their names, contact information, and your professional relationship\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e\u0026nbsp;\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eSummary\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eYou will be a programmer developing large-scale digital library systems as a part of a team of programmers, librarians, and designers working on major projects including development of an overall architecture to serve the U-M Library and campus. You will have opportunities to gain experience with modern technologies that support research, digital preservation, publishing, archives and broad public access.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eAppointment length: Three-year term-limited appointment\u0026nbsp;\u003c/strong\u003e\u003cbr /\u003e\u0026nbsp;\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eWho We Are\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eThe\u0026nbsp;\u003ca href=\"https://lib.umich.edu/about-us/our-divisions-and-departments/library-information-technology/digital-library-applications\"\u003eDigital Library Applications (DLA)\u003c/a\u003e\u0026nbsp;department is the group within the\u0026nbsp;\u003ca href=\"https://lib.umich.edu/about-us/our-divisions-and-departments/library-information-technology\"\u003eLibrary Information Technology (LIT)\u003c/a\u003e\u0026nbsp;division focused on the development of applications for management of and access to digital content held in library repositories. This includes applications for search and retrieval, display of content, creation and management of digital collections, and interoperability with other systems.\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://www.lib.umich.edu/\"\u003eThe University of Michigan Library\u003c/a\u003e\u0026nbsp;is one of the world\u0026#39;s largest academic research libraries and serves a vibrant university community that is home to 19 schools and colleges, 100 top-ten graduate programs, and annual research expenditures approaching $1.5 billion. To support the university\u0026#39;s world-changing work and to serve the public good, the library collects, preserves, and shares the scholarly and cultural record in all existing and emerging forms, and leads the reinvention of the academic research library in the digital age.\u003c/p\u003e\u003cp\u003eThe library is committed to recruiting and retaining a diverse workforce and encourages all employees to incorporate their diverse backgrounds, skills, and life experiences into their work. We advocate for diversity, equity, and inclusion. Our work engages a broad and diverse community with wide-ranging needs and concerns, and we empower all employees to participate in the ongoing process of learning about and responding to these needs. We value the cooperation that results from sharing and leveraging our different experiences, backgrounds, skills, talents, and interests to build an environment in which all our community members can flourish. Learn more in the\u0026nbsp;\u003ca href=\"https://www.lib.umich.edu/about-us/about-library/diversity-equity-inclusion-and-accessibility/diversity-strategic-plan\"\u003eLibrary\u0026#39;s Diversity Strategic Plan.\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u0026nbsp;\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eResponsibilities*\u003c/strong\u003e\u003c/p\u003e\u003cul\u003e\u003cli\u003eDevelopment, Deployment, and Maintenance (50%)\u003cul\u003e\u003cli\u003e\u0026shy;Develop, debug, modify and maintain complex software systems, including the full stack of components behind data-driven web applications and APIs.\u003c/li\u003e\u003cli\u003e\u0026shy;Configure and customize open source software and participate in collaborative development activity \u0026shy;using modern tools and techniques.\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u003c/li\u003e\u003cli\u003e\u0026shy;Review system and software designs and conduct functional tests.\u003c/li\u003e\u003cli\u003eMaintain internal documentation.\u003c/li\u003e\u003cli\u003eCreate containers and deployments.\u003c/li\u003e\u003c/ul\u003e\u003c/li\u003e\u003cli\u003eAnalysis and Design (20%)\u003cul\u003e\u003cli\u003eParticipate in the analysis of business and user needs, and the design of solutions involving computer software.\u003c/li\u003e\u003c/ul\u003e\u003c/li\u003e\u003cli\u003eOperational Support (20%)\u003cul\u003e\u003cli\u003eSupport the consistent operation of applications and workflows.\u003c/li\u003e\u003c/ul\u003e\u003c/li\u003e\u003cli\u003eParticipation in other meetings, events, training, and conferences (10%)\u003cul\u003e\u003cli\u003eParticipate in the open source communities with which we are engaged.\u003c/li\u003e\u003cli\u003eActively take part in professional development activities to expand skills and competencies.\u003c/li\u003e\u003c/ul\u003e\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e\u0026nbsp;\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eRequired Qualifications*\u003c/strong\u003e\u003c/p\u003e\u003cul\u003e\u003cli\u003eBachelor\u0026rsquo;s degree in Computer Science or related field and three or more years experience, or an equivalent amount of experience and education.\u003c/li\u003e\u003cli\u003eDemonstrated programming skills in a modern programming language.\u003c/li\u003e\u003cli\u003eExperience developing database-driven, user-focused web applications, or transferable relevant skills.\u003c/li\u003e\u003cli\u003eDemonstrated group work experience.\u003c/li\u003e\u003cli\u003eValues diversity and the importance of inclusion expressed through a commitment to apply and incorporate the differences, complexities, and opportunities that diversity brings to an organization.\u003c/li\u003e\u003cli\u003eAbility to perform the work remotely on a regular or temporary basis including maintaining work relationships, overall communication, meetings, training, professional development, etc.\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e\u0026nbsp;\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eDesired Qualifications*\u003c/strong\u003e\u003c/p\u003e\u003cul\u003e\u003cli\u003eExperience working in a command-line-based environment.\u003c/li\u003e\u003cli\u003eFamiliarity with developing inclusive software, such as accessibility (WCAG 2.0) and internationalization best practices.\u003c/li\u003e\u003cli\u003eExperience with version control systems such as Git.\u003c/li\u003e\u003cli\u003eExperience with test-driven development.\u003c/li\u003e\u003cli\u003eExperience with management of code dependencies, including dependency tracking and bundling.\u003c/li\u003e\u003cli\u003eExperience creating containers and deployments.\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e\u0026nbsp;\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eAdditional Information\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eReporting Structure\u003c/strong\u003e\u003cbr /\u003eReports directly to the LIT/DLA Department Head.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eSupervisory Experience\u003c/strong\u003e\u003cbr /\u003eNot applicable.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eSalary\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eThe salary range for this position is $68,000 - $83,000\u0026nbsp;annually. Final salary will be determined by experience and qualifications. Classification is at the Application Programmer / Analyst Intermediate level.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eWork Location\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eYou will have flexible scheduling and a remote, hybrid, or fully on-site work environment. Flexible work agreements are reviewed annually and are subject to change depending on the needs of the hiring department, throughout the course of employment. Please see the University of Michigan\u0026#39;s\u0026nbsp;\u003ca href=\"https://hr.umich.edu/working-u-m/management-administration/remote-employment-policies-agreements\"\u003eRemote Employment Policies and Agreement\u003c/a\u003es for more information.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eBenefits at the University of Michigan\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eThe University of Michigan offers a\u0026nbsp;\u003ca href=\"https://hr.umich.edu/benefits-wellness/benefits-enrollment/benefits-enrollment-eligibility/benefits-eligibility\"\u003ecomprehensive benefits package\u003c/a\u003e\u0026nbsp;including health, dental, and vision insurance, generous time off (24 vacation days per year, and 15 sick leave a year), matched retirement contributions with immediate vesting, professional development opportunities, and more. TIAA and Fidelity Investments\u0026#39; retirement benefits are available.\u003c/p\u003e\u003cp\u003e\u0026nbsp;\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eApplication Deadline\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eJob openings are posted for a minimum of seven calendar days.\u0026nbsp; The review and selection process may\u0026nbsp;begin as early as the eighth day after posting.\u0026nbsp;This\u0026nbsp;opening may be removed from posting boards and filled anytime after the minimum posting period has ended.\u003c/p\u003e\u003cp\u003e\u0026nbsp;\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eU-M EEO/AA Statement\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eThe University of Michigan is an equal opportunity/affirmative action employer.\u003c/p\u003e",
                "job_type": "full_time",
                "telecommute": true,
                "location": "Flexible (remote, hybrid, or fully on-site)",
                "contact": "John Weise, Head of Digital Library Applications\r\njweise@umich.edu",
                "published": true,
                "created_at": "2023-04-27T14:41:40.993Z",
                "updated_at": "2023-04-28T17:27:05.815Z",
                "published_at": "2023-04-28T17:27:05.814Z"
            },
            "relationships": {
                "employer": {
                    "links": {
                        "self": "https://jobs.code4lib.org/employers/university-of-michigan-library"
                    },
                    "data": {
                        "id": 224076,
                        "name": "University of Michigan Library"
                    }
                }
            },
            "links": {
                "self": "https://jobs.code4lib.org/jobs/57226-applications-programmer-analyst"
            }
        },
        {
            "id": 57225,
            "attributes": {
                "title": "Lead Developer",
                "origin": "https://jobs.code4lib.org/jobs",
                "url": "https://temple.taleo.net/careersection/tu_ex_staff/jobdetail.ftl?job=23001093\u0026tz=GMT-04%3A00\u0026tzname=America%2FNew_York",
                "description": "\u003cp\u003eGrade: T27\u003c/p\u003e\u003cp\u003eThe link below will give you information about the University\u0026rsquo;s \u0026ldquo;T\u0026rdquo; salary structure.\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://careers.temple.edu/sites/careers/files/documents/T_Salary_Structure.pdf\"\u003eLearn more about the \u0026ldquo;T\u0026rdquo; salary structure\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eA variety of important factors are reviewed by HR when considering salary, including job duties, the applicant\u0026rsquo;s education and experience, all relevant internal equity considerations, department budget, and funding source.\u003c/p\u003e\u003cp\u003eReporting to the Director of Library Technology and Knowledge Management, working in close collaboration with the Assistant Director for Library Technology, the Head of Metadata and Digitization Services, and Head of the Duckworth Digital Scholars Studio, the Lead Technology Developer develops and maintains the technological infrastructure for library systems which includes the library\u0026rsquo;s content management systems, search interface, digital collections, online exhibit systems, and scholarly publishing applications.\u003c/p\u003e\u003cp\u003eThe Lead Developer takes a principal role in coordinating the development of the library\u0026rsquo;s architecture as a whole and contributes to strategic decision-making about IT infrastructure and software platform choices. Supervises software developers and provides leadership in partnership with peer department heads in the overall planning of IT systems. Gathers technical requirements and helps to identify technology-based solutions for library services. Designs, implements, tests, and deploys software and systems. Performs other related duties as assigned.\u003c/p\u003e\u003cp\u003eTemple University Libraries serves the Temple community and beyond, including more than 33,000 students; over 2,000 full-time faculty; and researchers and visitors on Main, Center City, and Health Sciences Center campuses in Philadelphia and on our Ambler and Harrisburg campuses. We are committed to providing research and learning services, offering open access to our facilities and information resources, and fostering innovation and experimentation. Our collections total more than four million physical and digital titles, over 275,000 print and electronic journal subscriptions, and more than 700 research databases. We also collect, preserve, and provide access to a broad universe of special collections, including rare books, manuscripts, archives, photographs, and more. As part of our library enterprise, the award-winning Temple University Press supports our mission to advance learning and scholarship.\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://careers.temple.edu/careers-temple\"\u003eClick here\u003c/a\u003e to learn more about the benefits of working at Temple University.\u003c/p\u003e\u003cp\u003e\u003cem\u003ePlease note this position will work remotely. The duration of remote work will be at the discretion of Temple University and the hiring department.\u003c/em\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eRequired Education \u0026amp; Experience:\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eBachelor\u0026rsquo;s degree in a related field and three (3) years of experience managing information system development and implementation. Demonstrated experience with application development in at least one major programming language such as Ruby on Rails, PHP, or Java.\u003c/p\u003e\u003cp\u003eDemonstrated experience with web-based development and software integration, for instance using REST APIs, and JSON or XML for data interoperability. Demonstrated experience managing deployments in cloud-based environments. Experience supervising developers. An equivalent combination of education and experience may be considered.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eRequired Skills \u0026amp; Abilities:\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e*Strong management and team-leading background.\u003cbr /\u003e*Strong interpersonal skills, demonstrated ability to work in a collaborative team-based environment, and to communicate well with IT and non-IT staff.\u003cbr /\u003e*Strong organizational skills and demonstrated ability to manage projects.\u003cbr /\u003e*Demonstrated ability to write clear documentation.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e\u0026nbsp;Preferred:\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e*Master\u0026rsquo;s degree in Computer Science, Library Science, Information Science, Instructional Technology, or a related field.\u003cbr /\u003e*Experience with Kubernetes\u003cbr /\u003e*Experience with Amazon Web Services (AWS)\u003cbr /\u003e*Familiarity with Continuous Development /Continuous Deployment (CI/CD) technologies\u003cbr /\u003e*Experience working with open-source software\u003cbr /\u003e*Experience working in an Agile project management environment.\u003cbr /\u003e*Experience with software development in an academic library or higher education setting.\u003c/p\u003e\u003cp\u003eTemple University is committed to a policy of equal opportunity for all in every aspect of its operations, including employment, service, and educational programs. The University has pledged not to discriminate on the basis of age, color, disability, marital status, national origin or ethnic origin, race, religion, sex (including pregnancy), sexual orientation, gender identity, genetic information or veteran status.\u003c/p\u003e\u003cp\u003e\u003cem\u003eIn accordance with the City of Philadelphia\u0026#39;s COVID-19 mandate, all Temple University students, faculty, staff, and contractors must be fully vaccinated before receiving authorization to work unless they have a medical or religious exemption approved by the University.\u0026nbsp; An individual is only considered fully vaccinated two (2) weeks after receiving the 2nd shot of a primary two-dose vaccine or a single dose primary vaccine shot. Individuals who do not meet the University\u0026#39;s vaccination or exemption requirement will be prohibited from working until proof of full vaccination, or an exemption is requested and approved.\u0026nbsp; For more information, visit the University\u0026#39;s Vaccines web page\u003c/em\u003e. \u003ca href=\"https://www.temple.edu/coronavirus/vaccines\"\u003eClick here\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eCompliance Statement: In the performance of their functions as detailed in the position description employees have an obligation to avoid ethical, legal, financial and other conflicts of interest to ensure that their actions and outside activities do not conflict with their primary employment responsibilities at the institution. Employees are also expected to understand and be in compliance with applicable laws, University and employment policies and regulations, including NCAA regulations for areas and departments which their essential functions cause them to interact.\u003c/p\u003e\u003cp\u003eTemple University\u0026#39;s Annual Security and Fire Safety Report contains statistics, policies, and procedures related to campus safety. \u003ca href=\"https://safety.temple.edu/crime-reports/annual-security-report\"\u003eClick here\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eYou may request a copy of the report by calling Temple University\u0026rsquo;s Campus Safety Services at 215-204-7900.\u003c/p\u003e\u003cp\u003ePrimary Location: Pennsylvania-Philadelphia-Main Campus-Charles Library\u003c/p\u003e\u003cp\u003eJob: Staff\u003c/p\u003e\u003cp\u003eSchedule: Full-time\u003c/p\u003e\u003cp\u003eShift: Day Job\u003c/p\u003e\u003cp\u003eEmployee Status: Regular\u003c/p\u003e\u003cp\u003e\u0026nbsp;\u003c/p\u003e",
                "job_type": "full_time",
                "telecommute": true,
                "location": "Philadelphia, PA",
                "contact": "",
                "published": true,
                "created_at": "2023-04-27T13:31:40.739Z",
                "updated_at": "2023-04-28T17:26:58.379Z",
                "published_at": "2023-04-28T17:26:58.377Z"
            },
            "relationships": {
                "employer": {
                    "links": {
                        "self": "https://jobs.code4lib.org/employers/temple-university-libraries"
                    },
                    "data": {
                        "id": 224397,
                        "name": "Temple University Libraries"
                    }
                }
            },
            "links": {
                "self": "https://jobs.code4lib.org/jobs/57225-lead-developer"
            }
        },
        {
            "id": 57215,
            "attributes": {
                "title": "Systems Librarian",
                "origin": "https://jobs.code4lib.org/jobs",
                "url": "https://apply.interfolio.com/123179",
                "description": "\u003cp\u003eColumbia University Libraries seeks an experienced Systems Librarian to join our Library Infrastructure Systems team. Reporting to the Head of Library Infrastructure Systems, the successful candidate will incorporate the skillsets of a programmer/analyst as well as that of an academic librarian with knowledge of library systems. This role will serve as the technical expert for the library\u0026rsquo;s integrated library system, currently Voyager. The Systems Librarian will be responsible for maintenance and troubleshooting problems related to the ILS, as well as working toward a migration to a modern system. This position will also work to ensure optimal performance of systems in the Columbia University Libraries environment, including: the Voyager ILS, Blacklight discovery layer, self-hosted EZProxy, ILLiad, BorrowDirect, various digital collection management and archival management services, and other applications.\u0026nbsp;\u003c/p\u003e\u003cp\u003eThe Systems Librarian will support the research and learning needs of the University by ensuring that the catalog and related services and systems are properly maintained. The Systems Librarian will ensure University IT policies regarding both systems design and implementation as well as patron privacy and systems security are adhered to.\u003c/p\u003e\u003cp\u003eDiversity, equity, and inclusion are at the core of this position, and the successful hire will be expected to help make the Libraries\u0026rsquo; commitment to these values tangible by having DEI principles and a commitment to anti-racism guide their work.\u003c/p\u003e\u003cp\u003eThis role is being hired at the same time as another librarian position in Library Infrastructure Systems.\u0026nbsp; In addition to this position, we are also recruiting for a Discovery Services Librarian. These positions each have specific areas of expertise, but will work together to provide support for several other library technologies that this department provides.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eResponsibilities:\u003c/strong\u003e\u0026nbsp;\u003c/p\u003e\u003cul\u003e\u003cli\u003e\u003cp\u003eServe as the technical expert for the library\u0026rsquo;s Voyager ILS; maintain and enhance its operations as well as applications that support its service\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eProvide leadership in solving problems associated with the ILS and other services\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eDevelop and document internal processes and procedures to support operations within Library Infrastructure Systems\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eMonitor industry trends and best practices related to library technology, and recommend improvements to existing tools and workflows as appropriate.\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eCollaborate with librarians and colleagues across the campus on committees and projects to support library services\u003c/p\u003e\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e\u003cstrong\u003eAbout Columbia University Libraries\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eWe encourage individuals with diverse backgrounds, experiences, identities, and abilities to apply for this unique opportunity to become a part of our evolving Libraries and University community. Columbia University Libraries is a globally-recognized academic research library system, serving one of the world\u0026rsquo;s most important centers of research and learning in the most exciting and dynamic city in the world. Talented Libraries staff build, sustain, and make discoverable collections that transcend traditional boundaries of format and domain, keeping pace with a dynamic and rapidly evolving information environment and creating opportunities for users to encounter 4,000 years of human thought.\u003c/p\u003e\u003cp\u003eOur decisions are informed by new curricula developed to meet the needs of a more diverse student body, new and emerging areas of research being conducted by a broad spectrum of researchers, including graduate students and newly-hired faculty, as well as by perspectives from the diminished or entirely lost voices of historically oppressed, marginalized, and underserved populations and communities. As an organization, the Libraries provides a supportive, connected environment where every employee\u0026rsquo;s perspective is valued and every employee is encouraged to grow. All staff members have an impact on Columbia\u0026rsquo;s mission to advance knowledge at the highest levels and make the results of research accessible to the world.\u003c/p\u003e\u003cp\u003eColumbia University has a longstanding commitment to diversity rooted in values of inclusion and social justice, a commitment reflected in the curriculum and throughout University life. Columbia welcomes applications from candidates who share these values and who will foster their contribution to the University\u0026rsquo;s educational mission. We invite applicants who have demonstrated creative approaches to empowering and mentoring staff, leading projects, solving problems, and developing user-centric programs, services, or collections.\u003c/p\u003e\u003cp\u003eQualifications\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eMinimum Qualifications:\u003c/strong\u003e\u003c/p\u003e\u003cul\u003e\u003cli\u003e\u003cp\u003eMaster\u0026rsquo;s Degree in Library Science or equivalent combination of education and experience\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003e3+ years experience with integrated library systems\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eDemonstrated experience with integrated library systems, working knowledge of library business processes, and automation\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eFamiliarity with library metadata standards including MARC and other common library tools\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eExcellent interpersonal, written, and oral communication skills. Ability to successfully support and communicate with persons at all levels of technical ability. Excellent organizational analytic, and abstraction skills\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eDemonstrated ability to learn new technologies and adapt to change\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eDemonstrated commitment to and support for an inclusive environment for staff and library users.\u0026nbsp;\u003c/p\u003e\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e\u003cstrong\u003ePreferred Qualifications:\u003c/strong\u003e\u003c/p\u003e\u003cul\u003e\u003cli\u003e\u003cp\u003eProgressive experience in technical analysis, enterprise systems deployment, computer systems design, complex system configuration, or technical implementation of library systems and services\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eExperience with vendor communication and project management\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eProgramming experience in support of libraries-related systems and in one or more of: Perl, Python, Ruby, Shell scripting\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eExperience with Unix operating environments\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eExperience with relational databases and SQL\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eExperience with enterprise-level service and technology migrations\u003c/p\u003e\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e\u003cstrong\u003eEqual Employment Opportunity Statement\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eColumbia University is an Equal Opportunity Employer / Disability / Veteran\u003c/p\u003e\u003cp\u003e\u003cstrong\u003ePay Transparency Disclosure\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eThe salary of the finalist selected for this role will be set based on a variety of factors, including but not limited to departmental budgets, qualifications, experience, education, licenses, specialty, and training.\u0026nbsp; The above hiring range represents the University\u0026rsquo;s good faith and reasonable estimate of the range of possible compensation at the time of posting.\u003c/p\u003e",
                "job_type": "full_time",
                "telecommute": false,
                "location": "New York, NY",
                "contact": "",
                "published": true,
                "created_at": "2023-04-27T00:14:21.898Z",
                "updated_at": "2023-04-27T01:34:17.039Z",
                "published_at": "2023-04-27T01:34:17.038Z"
            },
            "relationships": {
                "employer": {
                    "links": {
                        "self": "https://jobs.code4lib.org/employers/columbia-university-libraries"
                    },
                    "data": {
                        "id": 28,
                        "name": "Columbia University Libraries"
                    }
                }
            },
            "links": {
                "self": "https://jobs.code4lib.org/jobs/57215-systems-librarian"
            }
        },
        {
            "id": 57214,
            "attributes": {
                "title": "Discovery Services Librarian",
                "origin": "https://jobs.code4lib.org/jobs",
                "url": "https://apply.interfolio.com/123180",
                "description": "\u003cp\u003eColumbia University Libraries seeks a Discovery Services Librarian to join our Library Systems team. Reporting to the Head of Library Infrastructure Systems, the successful candidate will provide knowledge and expertise in the areas of software programming and analysis, specializing in library technologies and services. This role will develop expertise in the library\u0026rsquo;s Blacklight discovery layer, as well as other Ruby on Rails applications that support its service. This position will collaborate with colleagues across the campus in improving this service and associated systems. The services developed and maintained by the Discovery Services Librarian directly serve all faculty, students and scholars who use Columbia\u0026rsquo;s unified discovery system, CLIO, to access the Libraries\u0026rsquo; collections for their research and teaching needs.\u0026nbsp;\u003c/p\u003e\u003cp\u003eThe Discovery Services Librarian will support the research and learning needs of the University by maintaining the Blacklight discovery layer as well as related services.\u0026nbsp;\u003c/p\u003e\u003cp\u003eDiversity, equity, and inclusion is at the core of this position, and the successful hire will be expected to help make the Libraries\u0026rsquo; commitment to these values tangible by having DEI principles and a commitment to anti-racism guide their work.\u003c/p\u003e\u003cp\u003eThis role is being hired at the same time as another librarian position in Library Infrastructure Systems.\u0026nbsp; In addition to this position, we are also recruiting for a Systems Librarian. These positions each have specific areas of expertise, but will work together to provide support for several other library technologies that this department provides.\u0026nbsp;\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eResponsibilities:\u003c/strong\u003e\u0026nbsp;\u003c/p\u003e\u003cul\u003e\u003cli\u003e\u003cp\u003eDevelop expertise in the library\u0026rsquo;s Blacklight discovery layer; maintain and enhance its operations as well as other Ruby on Rails applications that support its service\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eCollaborate with librarians and colleagues across the campus on committees and projects to support library services including service on Columbia\u0026rsquo;s Unified Discovery committee\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eManage the EZProxy service including troubleshooting access issues and installing updates\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eDevelop and document internal processes and procedures to support operations within the Library Systems Group\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eMonitor industry trends and best practices related to library technology, and recommend improvements to existing tools and workflows as appropriate.\u003c/p\u003e\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e\u003cstrong\u003eAbout Columbia University Libraries\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eWe encourage individuals with diverse backgrounds, experiences, identities, and abilities to apply for this unique opportunity to become a part of our evolving Libraries and University community. Columbia University Libraries is a globally-recognized academic research library system, serving one of the world\u0026rsquo;s most important centers of research and learning in the most exciting and dynamic city in the world. Talented Libraries staff build, sustain, and make discoverable collections that transcend traditional boundaries of format and domain, keeping pace with a dynamic and rapidly evolving information environment and creating opportunities for users to encounter 4,000 years of human thought.\u003c/p\u003e\u003cp\u003eOur decisions are informed by new curricula developed to meet the needs of a more diverse student body, new and emerging areas of research being conducted by a broad spectrum of researchers, including graduate students and newly-hired faculty, as well as by perspectives from the diminished or entirely lost voices of historically oppressed, marginalized, and underserved populations and communities. As an organization, the Libraries provides a supportive, connected environment where every employee\u0026rsquo;s perspective is valued and every employee is encouraged to grow. All staff members have an impact on Columbia\u0026rsquo;s mission to advance knowledge at the highest levels and make the results of research accessible to the world.\u003c/p\u003e\u003cp\u003eColumbia University has a longstanding commitment to diversity rooted in values of inclusion and social justice, a commitment reflected in the curriculum and throughout University life. Columbia welcomes applications from candidates who share these values and who will foster their contribution to the University\u0026rsquo;s educational mission. We invite applicants who have demonstrated creative approaches to empowering and mentoring staff, leading projects, solving problems, and developing user-centric programs, services, or collections.\u003c/p\u003e\u003cp\u003e\u0026nbsp;\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eQualifications\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eMinimum Qualifications:\u003c/strong\u003e\u003c/p\u003e\u003cul\u003e\u003cli\u003eMaster\u0026rsquo;s Degree in Library Science or related degree or equivalent combination of education and experience\u003c/li\u003e\u003cli\u003e\u003cp\u003e1-3 years of experience\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eFamiliarity with library metadata standards including MARC\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eDemonstrated ability to learn new technologies and adapt to change\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eDemonstrated commitment to and support for an inclusive environment for staff and library users.\u0026nbsp;\u003c/p\u003e\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e\u003cstrong\u003ePreferred Qualifications:\u003c/strong\u003e\u003c/p\u003e\u003cul\u003e\u003cli\u003e\u003cp\u003eProgramming experience in one of Ruby, Python, Perl\u0026nbsp;\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eExperience with EZProxy administration\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eExperience with Unix operating environments\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eExperience with relational databases and SQL\u003c/p\u003e\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e\u0026nbsp;\u003c/p\u003e\u003cp\u003eEqual Employment Opportunity Statement\u003c/p\u003e\u003cp\u003eColumbia University is an Equal Opportunity Employer / Disability / Veteran\u003c/p\u003e\u003cp\u003e\u003cstrong\u003ePay Transparency Disclosure\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eThe salary of the finalist selected for this role will be set based on a variety of factors, including but not limited to departmental budgets, qualifications, experience, education, licenses, specialty, and training.\u0026nbsp; The above hiring range represents the University\u0026rsquo;s good faith and reasonable estimate of the range of possible compensation at the time of posting.\u003c/p\u003e",
                "job_type": "full_time",
                "telecommute": false,
                "location": "New York",
                "contact": "",
                "published": true,
                "created_at": "2023-04-27T00:11:03.942Z",
                "updated_at": "2023-04-27T01:34:18.255Z",
                "published_at": "2023-04-27T01:34:18.255Z"
            },
            "relationships": {
                "employer": {
                    "links": {
                        "self": "https://jobs.code4lib.org/employers/columbia-university-libraries"
                    },
                    "data": {
                        "id": 28,
                        "name": "Columbia University Libraries"
                    }
                }
            },
            "links": {
                "self": "https://jobs.code4lib.org/jobs/57214-discovery-services-librarian"
            }
        },
        {
            "id": 57203,
            "attributes": {
                "title": "Web Services Manager",
                "origin": "https://jobs.code4lib.org/jobs",
                "url": "https://city-boston.icims.com/jobs/24075/web-services-manager/job?hub=8",
                "description": "\u003cp\u003ePosition Overview \u0026nbsp;\u0026nbsp;\u0026nbsp;\u003c/p\u003e\u003cp\u003eUnder the direction of the Chief of Digital and Online Services, the Web Services Manager is responsible for the design, development, implementation, and operation of the library\u0026rsquo;s online services, primarily delivered on web and mobile platforms. This role is seen as a hands-on management role, informed by the ideal of online library services as a 24-7 function. The role must embody a customer service philosophy based on delivering services that are user-friendly, responsive, and reliable.\u003c/p\u003e\u003cp\u003eSupervises: Professional and support staff\u003c/p\u003e\u003cp\u003eResponsibilities:\u003c/p\u003e\u003cp\u003eUnder direction, governs development and design of all library-managed web and online sites and mobile applications. Informs growth and maturation of site content and interfaces in collaboration with key internal and external stakeholders, in particular with Library Services leadership, Communications Office staff, IT leadership, and the Application Manager.\u003c/p\u003e\u003cp\u003eAssists with the development of policies and procedures related to online library services and technologies.\u003c/p\u003e\u003cp\u003eAssists with the development of the BPL\u0026rsquo;s strategy for offering library services across mobile platforms, technology choices, and online services to staff across web platforms, such as through the staff intranet and portal; as well as the implementation and maintenance of same, in conjunction with library service and budget priorities.\u003c/p\u003e\u003cp\u003eMonitors the customer experience; evaluates customer service requests; develops project plans, initiates services, activities and changes in operation to provide highest quality service through application of best practices.\u003c/p\u003e\u003cp\u003eWorks closely with the Communications team on the implementation, editing, deployment, and content of web and online library technology services.\u003c/p\u003e\u003cp\u003eResponsible for the library\u0026rsquo;s online discovery layer and its integration with the Integrated Library System.\u003c/p\u003e\u003cp\u003eActs as chief liaison to appropriate vendors to ensure vendor responsiveness to Library needs and problems, both short term and long term, regarding both proactive and reactive stances.\u003c/p\u003e\u003cp\u003eIn partnership with the Communications Office, works to ensure the library\u0026rsquo;s online presence, brand and messaging, across all platforms, are managed and developed in a timely, consistent and professional manner, in alignment with the Library\u0026rsquo;s Strategic goals.\u003c/p\u003e\u003cp\u003eParticipates in the supervision, recruitment, selection, training, performance, discipline, development, and evaluation of staff.\u003cbr /\u003ePerforms related duties and functions as assigned.\u003c/p\u003e\u003cp\u003eCompetencies:\u003c/p\u003e\u003cp\u003eAbility to act as team leader and to work as part of team. Demonstrated ability to work in team environment and to be responsive to stakeholder needs.\u003c/p\u003e\u003cp\u003eDemonstrated ability to analyze public service needs and to develop work processes designed to effectively support public services.\u003c/p\u003e\u003cp\u003eDemonstrated ability to work collaboratively with all library units to improve library service delivery to the public.\u003c/p\u003e\u003cp\u003eExcellent written and oral communication skills.\u003c/p\u003e\u003cp\u003eDemonstrated facility with web application and library technologies, including HTML, CSS, REST APIs, SIP, and webhooks.\u003c/p\u003e\u003cp\u003eAbility to plan and supervise the work of others.\u003c/p\u003e\u003cp\u003eDemonstrates initiative and independent decision-making skills.\u003c/p\u003e\u003cp\u003eCommunicates effectively and presents ideas clearly.\u003c/p\u003e\u003cp\u003eAbility to think creatively and innovatively.\u003c/p\u003e\u003cp\u003eIdentifies, plans, and prioritizes job responsibilities and tasks; determines and implements project timelines.\u003c/p\u003e\u003cp\u003eDemonstrates flexibility and the ability to adapt to change.\u003c/p\u003e\u003cp\u003eAbility to collaborate with library staff, external partners and resources.\u003cbr /\u003eInitiative in generating new ideas; a proven ability to work well under pressure and meet inflexible deadlines.\u003c/p\u003e\u003cp\u003eQualifications:\u003c/p\u003e\u003cp\u003eEducation \u0026ndash; A bachelor\u0026rsquo;s degree from a recognized college or university and a master\u0026rsquo;s degree in library science from an ALA accredited library school.\u003c/p\u003e\u003cp\u003eRelevant subject knowledge and/or specialized training required. \u0026nbsp;In exceptional instances, training and/or experience may be substituted for part or all of the educational requirements.\u003c/p\u003e\u003cp\u003eExperience \u0026ndash; Five years of appropriate library experience, including a minimum of two years supervisory and/or management experience, or any equivalent combination of education, experience and training sufficient to indicate ability to do the work.\u003c/p\u003e\u003cp\u003eTechnology skills appropriate to perform the duties of the job. Experience working with library technology desired. Experience with library cataloging principles desired.\u003cbr /\u003eProficiency in a language other than English desirable.\u003c/p\u003e\u003cp\u003eRequirements:\u003c/p\u003e\u003cp\u003eDemonstrated knowledge web development technologies, standards, issues and trends. \u0026nbsp;\u0026nbsp;\u003cbr /\u003eResidency \u0026ndash; Must be a resident of the City of Boston upon the first day of hire.\u003cbr /\u003eCORI \u0026ndash; Must successfully clear a Criminal Offenders Record Information check with the City of Boston.\u003c/p\u003e\u003cp\u003eUnion Code/Salary Plan/Grade: PSA/P-5\u003c/p\u003e\u003cp\u003eTo apply for this position, \u003ca href=\"https://city-boston.icims.com/jobs/24075/web-services-manager/job?hub=8\"\u003eplease visit the City of Boston Career Center Portal\u003c/a\u003e.\u003c/p\u003e",
                "job_type": "full_time",
                "telecommute": false,
                "location": "Boston, MA",
                "contact": "",
                "published": true,
                "created_at": "2023-04-25T20:10:31.449Z",
                "updated_at": "2023-04-27T01:34:22.030Z",
                "published_at": "2023-04-27T01:34:22.029Z"
            },
            "relationships": {
                "employer": {
                    "links": {
                        "self": "https://jobs.code4lib.org/employers/boston-public-library"
                    },
                    "data": {
                        "id": 621,
                        "name": "Boston Public Library"
                    }
                }
            },
            "links": {
                "self": "https://jobs.code4lib.org/jobs/57203-web-services-manager"
            }
        },
        {
            "id": 57199,
            "attributes": {
                "title": "Senior Library Applications Developer",
                "origin": "https://jobs.code4lib.org/jobs",
                "url": "https://cornell.wd1.myworkdayjobs.com/en-US/CornellCareerPage/job/Senior-Library-Applications-Developer_WDR-00036169-2",
                "description": "\u003cul\u003e\u003cli\u003e\u003cp\u003e\u003cstrong\u003eAre you a creative and knowledgeable IT professional with experience developing, maintaining, and enhancing web applications that are user-focused?\u003c/strong\u003e\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003e\u003cstrong\u003eWould you thrive in a development team that delivers outstanding application experiences at a major Ivy League university?\u003c/strong\u003e\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003e\u003cstrong\u003eWould be interested in playing a key role in modernizing the library experience, and contributing to the academic mission of Cornell University?\u003c/strong\u003e\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eCornell University Library (CUL) is seeking a Senior Library Applications Developer. This is a great opportunity for an experienced developer who would like to join one of the most innovative academic library IT teams in the world.\u003c/p\u003e\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e\u003cstrong\u003eWhat you will do:\u003c/strong\u003e\u003c/p\u003e\u003cul\u003e\u003cli\u003e\u003cp\u003eCode, debug/troubleshoot, document, maintain, and enhance complex Library web applications and systems\u0026nbsp;\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eResearch and lead system architecture decisions\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eProvide technical guidance and leadership to team members\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eEffectively communicate conceptual ideas and system architecture rationales visually, verbally, and in writing with user advocacy a constant priority\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eWork collaboratively with users and stakeholders to analyze application needs\u0026nbsp;\u003c/p\u003e\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e\u003cstrong\u003eThis role requires:\u003c/strong\u003e\u003c/p\u003e\u003cul\u003e\u003cli\u003e\u003cp\u003eAt least 5 years of application development experience, a bachelor\u0026rsquo;s degree in a computing-related field, or an equivalent combination\u0026nbsp;\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eExpertise in multiple programming languages, such as Java, Python, and/or Ruby on Rails\u0026nbsp;\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eExpertise using JavaScript frameworks for building user interfaces, such as Vue.js or React.js\u0026nbsp;\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eAbility to quickly learn other programming languages, frameworks, and other technologies, as needed\u0026nbsp;\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eExpert-level knowledge of HTML, CSS, and JSON\u0026nbsp;\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eExperience implementing application integrations and/or data integrations\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eDemonstrated strong written and verbal and communication skills\u0026nbsp;\u0026nbsp;\u003c/p\u003e\u003c/li\u003e\u003c/ul\u003e",
                "job_type": "full_time",
                "telecommute": true,
                "location": "Ithaca, NY",
                "contact": "Philip Robinson\r\nDirector of Software Development\r\nphilip.robinson@cornell.edu",
                "published": true,
                "created_at": "2023-04-25T14:31:31.416Z",
                "updated_at": "2023-04-27T01:34:37.721Z",
                "published_at": "2023-04-27T01:34:37.720Z"
            },
            "relationships": {
                "employer": {
                    "links": {
                        "self": "https://jobs.code4lib.org/employers/cornell-university-library"
                    },
                    "data": {
                        "id": 422,
                        "name": "Cornell University Library"
                    }
                }
            },
            "links": {
                "self": "https://jobs.code4lib.org/jobs/57199-senior-library-applications-developer"
            }
        },
        {
            "id": 57186,
            "attributes": {
                "title": "User Experience Designer 2/3",
                "origin": "https://jobs.code4lib.org/jobs",
                "url": "https://careersearch.stanford.edu/jobs/user-experience-designer-2-3-21084",
                "description": "\u003cp\u003eThis position is dual posted as a User Experience Designer 2 or User Experience Designer 3. All applications must include a cover letter and resume as part of their submission.\u003c/p\u003e\u003cp\u003eStanford University Libraries is seeking a mid-level to senior User Experience Designer to join a team devoted to collaborative development of platforms and services to support the Library\u0026#39;s mission of creating, preserving and making digital resources available in support of teaching, learning and research. We are a mission-driven organization that emphasizes open, collaborative work and community engagement within Stanford and with partner institutions around the world.\u003c/p\u003e\u003cp\u003eThe User Experience Designer will take a primary role in understanding user requirements, defining functionality, and designing the interface and application flow of digital library services and web properties in order to meet user needs. The successful candidate will work on a variety of projects relating to the core functions of an academic library and its digital library, including discovery and fulfillment systems, digital object access and presentation, and many other patron-facing services. You will also work with your colleagues to ensure that our applications and services meet accessibility guidelines and best practices. Understanding and designing open standards and open source software will be part of the work of the position.\u0026nbsp;\u003c/p\u003e\u003cp\u003eA successful candidate will play an integral role in a small team environment that uses an agile design and development process, with close collaboration with other designers, developers, and product and service managers. In many cases, this role will extend beyond Stanford and into the broader digital library community, and include work on multi-institutional initiatives including open source software or grant-funded collaborative projects.\u003c/p\u003e\u003cp\u003eAbout Stanford Libraries\u003cbr /\u003eStanford Libraries is a network of over 15 libraries with over 400 employees committed to fueling teaching, learning and research across Stanford. Our dedication to discoverability and information management also has us engaged in dynamic global partnerships. The Stanford Libraries\u0026rsquo; values are rooted in a commitment to mutual respect and the idea that every member of the staff has something to contribute, and that learning is constant. We seek a team member who is ready to share their skills and perspectives and collaborate with colleagues across the organization.\u003c/p\u003e\u003cp\u003eThis position is part of the Access and Discovery Team within Digital Library Systems and Services (DLSS), the technology division of Stanford Libraries. Including this position, the Access and Discovery Team comprises six software engineers. We develop, maintain, and support a portfolio of services and applications that support patrons and users at and beyond Stanford University in finding and using materials for research, teaching, and learning. This includes our SearchWorks (our library catalog platform), the Stanford Libraries website, Spotlight at Stanford (our online exhibit platform), EarthWorks (our GIS data discovery platform), and other tools that deliver and present digital library content. The Access and Discovery Team values working as a self-directed and unified team, fostering community and collaboration, improving process incrementally through regular retrospectives, and fostering an environment with psychological safety, joy, and humor.\u003c/p\u003e\u003cp\u003eDLSS is a team of nearly 60 software developers, user experience designers, devops engineers, system administrators, service managers, and technologists. We develop and contribute to open source software and open standards communities like Mirador, the International Image Interoperability Framework, and Blacklight (including ArcLight, Spotlight, and GeoBlacklight). We also have helped host and facilitate events like the Lighting the Way Forum, Fantastic Futures, and the LDCX series of unconferences, and contribute to technical efforts on collaborative projects like Virtual Tribunals, the Digital Library of the Middle East, LD4P3, and more. DLSS works with our colleagues across the organization to world-class services and uphold the Stanford Libraries values. Find more about our recent work through looking at our recent demo videos on YouTube.\u003c/p\u003e\u003cp\u003eCORE DUTIES:\u003c/p\u003e\u003cp\u003eReporting to the Associate Director for Digital Systems and Services, DLSS, the User Experience Designer will (at all levels):\u003c/p\u003e\u003cp\u003e● \u0026nbsp; \u0026nbsp; \u0026nbsp;Define, design and test the functionality and interface of applications with user interfaces; work with users, product and service managers, software engineers, and other library staff to ensure designs aligned with user needs and underlying technology.\u003c/p\u003e\u003cp\u003e● \u0026nbsp; \u0026nbsp; \u0026nbsp;Conduct user research, create personas, identify required tasks and information flows for given systems.\u003c/p\u003e\u003cp\u003e● \u0026nbsp; \u0026nbsp; \u0026nbsp;Create relevant design artifacts, including, but not limited to, information architecture, requirements, personas, wireframe and data flows.\u003c/p\u003e\u003cp\u003e● \u0026nbsp; \u0026nbsp; \u0026nbsp;Make systems compliant with Stanford\u0026rsquo;s online accessibility policies by applying accessible design patterns and best practices.\u003c/p\u003e\u003cp\u003e● \u0026nbsp; \u0026nbsp; \u0026nbsp;Create and orchestrate graphic, visual and interactive design or work with specialists to integrate these into the interface.\u003c/p\u003e\u003cp\u003e● \u0026nbsp; \u0026nbsp; \u0026nbsp;Create application code to manifest the designs, or work with software engineers to develop them.\u003c/p\u003e\u003cp\u003e● \u0026nbsp; \u0026nbsp; \u0026nbsp;Conduct usability testing on applications during the development lifecycle; refine designs based on the results of testing.\u003c/p\u003e\u003cp\u003e● \u0026nbsp; \u0026nbsp; \u0026nbsp;Review metrics and user feedback for issues and opportunities for improvement; liaise with quality assurance and help desk specialists to identify defects in application functionality or design and create strategies for mitigation.\u003c/p\u003e\u003cp\u003e● \u0026nbsp; \u0026nbsp; \u0026nbsp;Contribute, maintain and review documentation on design assumptions, application requirements and specifications, business logic, training materials, help text, and release notes.\u003c/p\u003e\u003cp\u003e● \u0026nbsp; \u0026nbsp; \u0026nbsp;Engage with the broader cultural heritage community on the design and development of open source digital library applications. Participate in, and occasionally organize requirements gathering, business analysis, and systems design of software used not only by Stanford Libraries, but by peer institutions as well. This may include working directly with stakeholders, designers and software developers from other institutions.\u003c/p\u003e\u003cp\u003e● \u0026nbsp; \u0026nbsp; \u0026nbsp;Manage relationships with third party vendors implementing systems based on specifications produced by the Designer.\u003c/p\u003e\u003cp\u003eTo qualify at User Experience Designer 2 level:\u003c/p\u003e\u003cp\u003eEducation \u0026amp; Experience:\u003c/p\u003e\u003cp\u003eBachelor\u0026#39;s degree and three years of experience or combination of education and relevant\u003c/p\u003e\u003cp\u003eexperience.\u003c/p\u003e\u003cp\u003eKnowledge, Skills, and Abilities:\u003c/p\u003e\u003cp\u003e● \u0026nbsp; \u0026nbsp; \u0026nbsp;Requires knowledge of computer system capabilities, business processes and workflows.\u0026nbsp;\u003c/p\u003e\u003cp\u003e● \u0026nbsp; \u0026nbsp; \u0026nbsp;Experience in designing web applications.\u003c/p\u003e\u003cp\u003e● \u0026nbsp; \u0026nbsp; \u0026nbsp;Experience in current web technologies, such as JavaScript, AJAX, CSS, and HTML5.\u003c/p\u003e\u003cp\u003e● \u0026nbsp; \u0026nbsp; \u0026nbsp;Experience in responsive design, and application of human-computer interaction principles to application development.\u003c/p\u003e\u003cp\u003e● \u0026nbsp; \u0026nbsp; \u0026nbsp;Experience in designing for accessibility, ensuring access to information through assistive technologies.\u003c/p\u003e\u003cp\u003e● \u0026nbsp; \u0026nbsp; \u0026nbsp;Skill in conducting user research, user testing, usability testing and gathering requirements.\u003c/p\u003e\u003cp\u003e● \u0026nbsp; \u0026nbsp; \u0026nbsp;Skill in developing specifications and mockups using UI design tools and/or programming in web application languages.\u003c/p\u003e\u003cp\u003e● \u0026nbsp; \u0026nbsp; \u0026nbsp;Excellent communication skills, both written and verbal, including the ability to bridge functional and technical resources by communicating effectively with colleagues of varying systems expertise.\u003c/p\u003e\u003cp\u003e● \u0026nbsp; \u0026nbsp; \u0026nbsp;Ability to design and document complex business systems and workflows.\u0026nbsp;\u003c/p\u003e\u003cp\u003e● \u0026nbsp; \u0026nbsp; \u0026nbsp;Proven problem solving and analytical thinking and ability to approach problems systematically.\u003c/p\u003e\u003cp\u003eOther Relevant Knowledge, Skills and Abilities May Include:\u003c/p\u003e\u003cp\u003e● \u0026nbsp; \u0026nbsp; \u0026nbsp;Experience with library discovery and access environments and metadata standards, or interpretation of complex structured data for presentation and search.\u003c/p\u003e\u003cp\u003e● \u0026nbsp; \u0026nbsp; \u0026nbsp;Experience with web content management systems and templating languages\u003c/p\u003e\u003cp\u003e● \u0026nbsp; \u0026nbsp; \u0026nbsp;Experience working in, and facilitating, an agile design and software development process\u003c/p\u003e\u003cp\u003e● \u0026nbsp; \u0026nbsp; \u0026nbsp;Demonstrated experience in facilitating community or open source design processes\u003c/p\u003e\u003cp\u003e● \u0026nbsp; \u0026nbsp; \u0026nbsp;Illustrating design ideas using storyboards, process flows and/or sitemaps\u003c/p\u003e\u003cp\u003eTo qualify at User Experience Designer 3 level: With the above criteria, plus:\u003c/p\u003e\u003cp\u003eEducation \u0026amp; Experience:\u003c/p\u003e\u003cp\u003eBachelor\u0026#39;s degree and five years of relevant experience, or a similar combination of education\u003c/p\u003e\u003cp\u003eand relevant experience.\u003c/p\u003e\u003cp\u003eKnowledge, Skills, and Abilities:\u003c/p\u003e\u003cp\u003e● \u0026nbsp; \u0026nbsp; \u0026nbsp;Ability to define UX vision and inspire others to execute against it.\u003c/p\u003e\u003cp\u003e● \u0026nbsp; \u0026nbsp; \u0026nbsp;Advanced knowledge of computer systems, business processes and workflows.\u003c/p\u003e\u003cp\u003e● \u0026nbsp; \u0026nbsp; \u0026nbsp;Demonstrated experience in designing web applications.\u003c/p\u003e\u003cp\u003e● \u0026nbsp; \u0026nbsp; \u0026nbsp;Defining and undertaking user research, user testing, usability testing and gathering requirements.\u003c/p\u003e\u003cp\u003e● \u0026nbsp; \u0026nbsp; \u0026nbsp;Collaborate with partners to develop and maintain consistent standards for the end-to-end user experience, including linkages between key systems.\u003c/p\u003e\u003cp\u003eOther Relevant Knowledge, Skills and Abilities May Include:\u003c/p\u003e\u003cp\u003e● \u0026nbsp; \u0026nbsp; \u0026nbsp;Demonstrated leadership skills and experience modeling collaborative processes.\u003c/p\u003e\u003cp\u003e● \u0026nbsp; \u0026nbsp; \u0026nbsp;Advanced communication skills to clearly and effectively communicate information to internal and external audiences, and all levels of management.\u003c/p\u003e\u003cp\u003ePHYSICAL REQUIREMENTS*:\u003c/p\u003e\u003cp\u003e● \u0026nbsp; \u0026nbsp; \u0026nbsp;Constantly perform desk-based computer tasks.\u003c/p\u003e\u003cp\u003e● \u0026nbsp; \u0026nbsp; \u0026nbsp;Frequently stand/walk, grasp lightly/fine manipulation, grasp forcefully, and reach/work above shoulders.\u003c/p\u003e\u003cp\u003e● \u0026nbsp; \u0026nbsp; \u0026nbsp;Occasionally sit, twist/bend/stoop/squat.\u003c/p\u003e\u003cp\u003e● \u0026nbsp; \u0026nbsp; \u0026nbsp;Visual acuity including color vision.\u003c/p\u003e\u003cp\u003e*- Consistent with its obligations under the law, the University will provide reasonable\u003c/p\u003e\u003cp\u003eaccommodation to any employee with a disability who requires accommodation to perform the\u003c/p\u003e\u003cp\u003eessential functions of his or her job.\u003c/p\u003e\u003cp\u003eWORKING CONDITIONS:\u0026nbsp;\u003c/p\u003e\u003cp\u003e● \u0026nbsp; \u0026nbsp; \u0026nbsp;Occasionally work weekends, evenings, holidays, and flexible shifts.\u003c/p\u003e\u003cp\u003eWORK STANDARDS:\u0026nbsp;\u003c/p\u003e\u003cp\u003e● \u0026nbsp; \u0026nbsp; \u0026nbsp;Interpersonal Skills: Demonstrates the ability to work well with Stanford colleagues and clients and with external organizations.\u003c/p\u003e\u003cp\u003e● \u0026nbsp; \u0026nbsp; \u0026nbsp;Promote Culture of Safety: Demonstrates commitment to personal responsibility and value for safety; communicates safety concerns; uses and promotes safe behaviors based on training and lessons learned.\u003c/p\u003e\u003cp\u003e● \u0026nbsp; \u0026nbsp; \u0026nbsp;Subject to and expected to comply with all applicable University policies and procedures, including but not limited to the personnel policies and other policies found in the University\u0026#39;s Administrative Guide, http://adminguide.stanford.edu.\u003c/p\u003e\u003cp\u003eThe job duties listed are typical examples of work performed by positions in this job\u003c/p\u003e\u003cp\u003eclassification and are not designed to contain or be interpreted as a comprehensive inventory of\u003c/p\u003e\u003cp\u003eall duties, tasks, and responsibilities. Specific duties and responsibilities may vary depending on\u003c/p\u003e\u003cp\u003edepartment or program needs without changing the general nature and scope of the job or level\u003c/p\u003e\u003cp\u003eof responsibility. Employees may also perform other duties as assigned.\u003c/p\u003e\u003cp\u003eStanford is an equal employment opportunity and affirmative action employer. All qualified\u003c/p\u003e\u003cp\u003eapplicants will receive consideration for employment without regard to race, color, religion, sex,\u003c/p\u003e\u003cp\u003esexual orientation, gender identity, national origin, disability, protected veteran status, or any\u003c/p\u003e\u003cp\u003eother characteristic protected by law. Stanford welcomes applications from all who would bring\u003c/p\u003e\u003cp\u003eadditional dimensions to the University\u0026rsquo;s research, teaching and clinical missions.\u003c/p\u003e\u003cp\u003eThe position is part of the Access and Discovery team within Digital Library Systems and Services located on Stanford\u0026rsquo;s main campus. Local candidates are preferred, but we will consider qualified remote candidates.\u003c/p\u003e\u003cp\u003eThis position is eligible for full-time Hybrid or Remote work: Stanford University has five Regional Pay Structures. \u0026nbsp;The compensation for this position will be based on the location of the successful candidate. Local candidates preferred. The expected pay range for these positions are:\u003c/p\u003e\u003cp\u003eLevel 2: $110,000 to $138,000 per annum\u003c/p\u003e\u003cp\u003eLevel 3: $133,000 to $157,000 per annum\u003c/p\u003e\u003cp\u003eStanford University provides pay ranges representing its good faith estimate of what the university reasonably expects to pay for a position. The pay offered to a selected candidate will be determined based on factors such as (but not limited to) the scope and responsibilities of the position, the qualifications of the selected candidate, departmental budget availability, internal equity, geographic location, and external market pay for comparable jobs.\u003c/p\u003e\u003cp\u003eWhy Stanford is for You:\u003c/p\u003e\u003cp\u003eImagine a world without search engines or social platforms. Consider lives saved through first-ever organ transplants and research to cure illnesses. Stanford University has revolutionized the way we live and enriched the world. Supporting this mission is our diverse and dedicated 17,000 staff. We seek talent driven to impact the future of our legacy. Our culture and unique perks empower you with:\u003c/p\u003e\u003cp\u003e● \u0026nbsp; \u0026nbsp; \u0026nbsp;Freedom to grow. We offer career development programs, tuition reimbursement, and course auditing. Join a TedTalk, watch a film screening, or listen to a renowned author or global leaders speak.\u003c/p\u003e\u003cp\u003e● \u0026nbsp; \u0026nbsp; \u0026nbsp;A caring culture. We provide superb retirement plans, generous time-off, and family care resources.\u003c/p\u003e\u003cp\u003e● \u0026nbsp; \u0026nbsp; \u0026nbsp;A healthier you. Choose from hundreds of health or fitness classes at our world-class exercise facilities. We provide excellent health care benefits.\u003c/p\u003e\u003cp\u003e● \u0026nbsp; \u0026nbsp; \u0026nbsp;Discovery and fun. Stroll through historic sculptures, trails, and museums.\u003c/p\u003e\u003cp\u003e● \u0026nbsp; \u0026nbsp; \u0026nbsp;Enviable resources. Enjoy free commuter programs, ridesharing incentives, discounts and more.\u003c/p\u003e\u003cp\u003e\u0026nbsp;\u003c/p\u003e",
                "job_type": "full_time",
                "telecommute": true,
                "location": "Remote/Palo Alto, CA",
                "contact": "",
                "published": true,
                "created_at": "2023-04-24T18:51:34.315Z",
                "updated_at": "2023-04-27T01:34:54.126Z",
                "published_at": "2023-04-27T01:34:54.125Z"
            },
            "relationships": {
                "employer": {
                    "links": {
                        "self": "https://jobs.code4lib.org/employers/stanford-university-libraries"
                    },
                    "data": {
                        "id": 509,
                        "name": "Stanford University Libraries"
                    }
                }
            },
            "links": {
                "self": "https://jobs.code4lib.org/jobs/57186-user-experience-designer-2-3"
            }
        },
        {
            "id": 57185,
            "attributes": {
                "title": "Library Applications Developer",
                "origin": "https://jobs.code4lib.org/jobs",
                "url": "https://careers.ua.edu/jobs/it-technical-specialist-iv-library-applications-developer-519232-tuscaloosa-alabama-united-states",
                "description": "\u003cp\u003eAre you passionate about technology and helping to advance innovation, research, and society? The University of Alabama Libraries seek an enthusiastic and skilled technologist to collaborate in a research centered environment. Supporting the Technology Development Librarian, the position will design and develop customizations to specialized academic research library platforms used by the UA research community. Participate in the design, development, and support of complex library specific open-source web applications such as ArchivesSpace, Open Journal System, DSpace, CONTENTdm, Omeka S, and WordPress. Assist in performing user-centered needs assessments and will develop desired functionality. Assist in system integration projects between the multiple research platforms supported by University Libraries. Provide occasional project-based development support for the University Libraries Alabama Digital Humanities Center. Assist in developing web-based technology solutions for partnering academic areas.\u003c/p\u003e\u003cp\u003eThe position is eligible for a hybrid work arrangement.\u003c/p\u003e\u003cp\u003eMore information:\u003ca href=\"https://careers.ua.edu/jobs/it-technical-specialist-iv-library-applications-developer-519232-tuscaloosa-alabama-united-states\"\u003e\u0026nbsp;https://careers.ua.edu/jobs/it-technical-specialist-iv-library-applications-developer-519232-tuscaloosa-alabama-united-states\u003c/a\u003e\u003c/p\u003e",
                "job_type": "full_time",
                "telecommute": false,
                "location": "Tuscaloosa, AL",
                "contact": "",
                "published": true,
                "created_at": "2023-04-24T16:54:55.014Z",
                "updated_at": "2023-04-27T01:34:24.042Z",
                "published_at": "2023-04-27T01:34:24.040Z"
            },
            "relationships": {
                "employer": {
                    "links": {
                        "self": "https://jobs.code4lib.org/employers/the-university-of-alabama-libraries"
                    },
                    "data": {
                        "id": 1584,
                        "name": "The University of Alabama Libraries"
                    }
                }
            },
            "links": {
                "self": "https://jobs.code4lib.org/jobs/57185-library-applications-developer"
            }
        },
        {
            "id": 57184,
            "attributes": {
                "title": "Systems Librarian ",
                "origin": "https://jobs.code4lib.org/jobs",
                "url": "https://jobs.bridgew.edu/postings/24633",
                "description": "\u003cp\u003eJob Description\u003c/p\u003e\u003cp\u003eThe Maxwell Library at Bridgewater State University seeks an innovative, service-oriented Systems Librarian to develop, manage, document, and troubleshoot the library\u0026rsquo;s web site and core library systems. In close collaboration with the e-Resources Librarian, Digital Services \u0026amp; Metadata Librarian, the Head of Archives \u0026amp; Special Collections, the incumbent will maintain library systems and applications using a broad range of technologies. The Systems Librarian will also collaborate with Research \u0026amp; Instruction Librarians and partners from across BSU to research and implement practical, usable technology solutions to support the work of the students, faculty, librarians, staff and the broader BSU community.\u003c/p\u003e\u003cp\u003eThe Systems Librarian will be primarily responsible for management of Koha (Integrated Library System), the Maxwell Library website (which is set for a complete redesign in the upcoming months), Springshare\u0026rsquo;s LibApps suite of software, and the ILLiad Interlibrary Loan system, as well as any new applications the library may adopt or develop. The incumbent will also collaborate as required to maintain systems and applications that the e-Resources Librarian, Digital Services \u0026amp; Metadata Librarian, and the Head of Archives \u0026amp; Special Collections employ. The salary range is $57,000 to $67,000, dependent upon experience and education.\u003c/p\u003e\u003cp\u003eThe Systems Librarian reports directly to the Dean of the Library. The incumbent will serve as a library liaison in selected disciplines. Participation in professional organizations, service in library and university governance, and appropriate professional development activities are expected and required for tenure. In addition, the Systems Librarian may supervise Library Assistants, Graduate Assistants, and student workers.\u003c/p\u003e\u003cp\u003ePlease note: This position is eligible for hybrid remote/on-campus work options.\u003cbr /\u003e\u003cbr /\u003e\u003cstrong\u003eThe Systems Librarian will:\u003c/strong\u003e\u003c/p\u003e\u003cul\u003e\u003cli\u003eAdminister and maintain the library\u0026rsquo;s core systems, including Koha ILS, the library website, Springshare LibApps, and ILLiad interlibrary loan application. Ensure that systems remain available and interoperable.\u003c/li\u003e\u003cli\u003eCollaborate with librarians and staff as necessary to support and troubleshoot other library applications, including Virtual Commons (BEPress Institutional Repository), EZProxy, Omeka, ArchiveSpace, ArchiveIt, Ebsco Discovery Service, and related systems.\u003c/li\u003e\u003cli\u003eWork closely with the Library staff and vendors on a full redesign of the Maxwell Library\u0026rsquo;s website and related technologies.\u003c/li\u003e\u003cli\u003eProvide technical expertise, day-to-day administration, and broad support for traditional and emerging library hardware and software solutions and standards. Research and recommend technologies to support evolving library reference, instruction, and access services models.\u003c/li\u003e\u003cli\u003eProvide library systems support to library colleagues. Understand and respond to library systems-related needs across library units.\u003c/li\u003e\u003cli\u003eCollaborate closely with the BSU IT Department as necessary, to implement and support authentication and security services.\u003c/li\u003e\u003cli\u003eServe as a point of contact for library systems and emerging technology vendors.\u003c/li\u003e\u003cli\u003eProvide written reports, assessments, analyses, and documentation as needed and upon request.\u003c/li\u003e\u003cli\u003eAdvise, train, and teach staff, faculty, and students in new library technologies.\u003c/li\u003e\u003cli\u003eEngage in professional activities, continuing scholarship, and University-wide committees, to satisfy promotion and tenure requirements of the Massachusetts State College Association (MSCA) contract.\u003c/li\u003e\u003cli\u003eServe as liaison to one or more academic departments.\u003c/li\u003e\u003c/ul\u003e\u003cp\u003eAcademic rank at hire will be determined by the candidate\u0026rsquo;s qualifications and MSCA contract specifications.\u003c/p\u003e\u003cp\u003eBenefits \u0026amp; Additional Compensation Info\u003c/p\u003e\u003cp\u003ehttps://www.bridgew.edu/office/human-resources-and-talent-management\u0026nbsp;\u003c/p\u003e\u003cp\u003eAdditional Info \u0026amp; Requirements\u003c/p\u003e\u003cp\u003eRequired Qualifications:\u003c/p\u003e\u003cul\u003e\u003cli\u003eMaster\u0026rsquo;s degree in Library and Information Science from an ALA-accredited institution.\u003c/li\u003e\u003cli\u003eRelevant experience in an academic, large public, or special library.\u003c/li\u003e\u003cli\u003eFamiliarity with library operations, procedures, and best practices.\u003c/li\u003e\u003cli\u003eDemonstrated experience using a wide variety of library system platforms and applications, and current library-related hardware and software.\u003c/li\u003e\u003cli\u003eUnderstanding of library security and authentication systems and practices.\u003c/li\u003e\u003cli\u003eWeb application programming experience including but not limited to HTML, XML, CSS, and Javascript.\u003c/li\u003e\u003cli\u003eFamiliarity with database reporting standards.\u003c/li\u003e\u003cli\u003eAbility to work independently and effectively in a team setting.\u003c/li\u003e\u003cli\u003eEffective communication and interpersonal skills.\u003c/li\u003e\u003c/ul\u003e\u003cp\u003ePreferred Qualifications:\u003c/p\u003e\u003cul\u003e\u003cli\u003eExperience managing EZProxy or another access authentication software.\u003c/li\u003e\u003cli\u003eExperience with the Koha ILS and Springshare\u0026rsquo;s LibApps.\u003c/li\u003e\u003cli\u003eSecond master\u0026rsquo;s degree in a related discipline (second master\u0026rsquo;s degree required for promotion beyond Associate Librarian rank).\u003c/li\u003e\u003cli\u003eTwo years\u0026rsquo; experience in an academic library setting.\u003c/li\u003e\u003cli\u003eDemonstrated ability to support an inclusive educational and work environment, working effectively with a diverse faculty and student population.\u003c/li\u003e\u003cli\u003eUnderstanding of networking, including cloud-based server technology.\u003c/li\u003e\u003cli\u003eExperience with website design and various hosting platforms such as WordPress or Drupal.\u003c/li\u003e\u003cli\u003eStrong analytical and critical thinking skills.\u003c/li\u003e\u003c/ul\u003e\u003cp\u003ePlease be aware that employment at Bridgewater State University is contingent upon completion of a successful background check.\u003cbr /\u003e\u003cbr /\u003eThis position is not eligible for H-1B visa sponsorship.\u003c/p\u003e\u003cp\u003eThe Community\u003c/p\u003e\u003cp\u003eBridgewater State University\u0026rsquo;s Library Services is located in the Clement C. Maxwell Library and is open an average of 94 hours each week during the academic year. It is a busy, dynamic place with classrooms, academic and administrative offices throughout the building. The library serves all BSU students, faculty, staff, and researchers from across the country and world.\u003cbr /\u003e\u003cbr /\u003eLibrary Services is dedicated to meeting the needs of its communities, to updating its service models as pedagogies and librarianship evolve, to renewing the knowledge and skills of librarians and staff as practices change, to deploying new technologies to improve interactions with library users and user experiences. Successful candidates will be staff members who can work with their colleagues to help meet the mission of the department in serving and supporting our racially and ethnically diverse campus community.\u003cbr /\u003e\u003cbr /\u003e\u003cem\u003eBridgewater State University is an inclusive community dedicated to the lifelong success of all students; focused on the continuous improvement of its people; and is responsible for leading innovation that benefits Southeastern Massachusetts, the commonwealth, and the world. Bridgewater\u0026rsquo;s accessible environment of teaching and learning stimulates critical thinking and the pursuit of new knowledge and deeper understanding. The teaching and learning environment at Bridgewater also cultivates meaningful and diverse interpersonal relationships and fosters an appreciation for global engagement aimed at transforming lives and improving the human condition.\u003c/em\u003e\u003c/p\u003e\u003cp\u003e\u003cem\u003eOur commitment to diversity, equity, and inclusion is reflected in our\u0026nbsp;\u003c/em\u003e\u003ca href=\"https://www.bridgew.edu/bsuvalues\"\u003e\u003cem\u003e\u003cstrong\u003einstitutional values\u003c/strong\u003e\u003c/em\u003e\u003c/a\u003e\u003cem\u003e, which ensure that all students are supported and succeed.\u003c/em\u003e\u003c/p\u003e\u003cp\u003e\u0026nbsp;\u003c/p\u003e\u003cp\u003eHR Info\u003c/p\u003e\u003cp\u003e\u0026nbsp;\u003c/p\u003e\u003cp\u003ePlease note the following information is required to complete your application for this position:\u003c/p\u003e\u003cul\u003e\u003cli\u003eA minimum of three (3) professional reference entries in space provided on the application form.\u003c/li\u003e\u003cli\u003eCV\u003c/li\u003e\u003cli\u003eCover Letter\u003c/li\u003e\u003cli\u003eEquity and Inclusion Statement- a personal statement on a candidate\u0026rsquo;s past efforts to enhance diversity, equity, and inclusion. The equity and inclusion statement is an opportunity for candidates to discuss scholarship, professional skills, and demonstrable experience that would enhance the university\u0026rsquo;s efforts to promote a diverse, equitable, and inclusive community. Equity and inclusion statements will be considered as part of a transparent and comprehensive review of candidates\u0026rsquo; application materials.\u003c/li\u003e\u003c/ul\u003e",
                "job_type": "full_time",
                "telecommute": false,
                "location": "Bridgewater, MA",
                "contact": "Bridgewater State University Office of Human Resources and Talent Management 508-531-1324 humres@bridgew.edu",
                "published": true,
                "created_at": "2023-04-24T14:02:33.141Z",
                "updated_at": "2023-04-27T01:34:25.440Z",
                "published_at": "2023-04-27T01:34:25.436Z"
            },
            "relationships": {
                "employer": {
                    "links": {
                        "self": "https://jobs.code4lib.org/employers/bridgewater-state-university"
                    },
                    "data": {
                        "id": 256,
                        "name": "Bridgewater State University"
                    }
                }
            },
            "links": {
                "self": "https://jobs.code4lib.org/jobs/57184-systems-librarian"
            }
        },
        {
            "id": 57154,
            "attributes": {
                "title": "IT Project Manager II",
                "origin": "https://jobs.code4lib.org/jobs",
                "url": "https://arizona.csod.com/ux/ats/careersite/4/home/requisition/14529?c=arizona",
                "description": "\u003cp\u003eThe University of Arizona Libraries (UAL) seeks a project manager to join the Technology Strategy \u0026amp; Services department (TeSS) in the Project \u0026amp; Portfolio Management unit. As one of two unit members, you\u0026#39;ll support project work happening within the department and communicate with stakeholders across the library.\u003c/p\u003e\u003cp\u003eIn this position you\u0026#39;ll coordinate project work in the areas of software development, operations, or other types of IT work, from start to finish across multiple work styles and tools, facilitate gathering and refining requirements, and work towards shared understanding for implementers and stakeholders. By documenting, supporting, and improving work processes within the department, you\u0026#39;ll help implementers easily onboard to different areas of our portfolio and support cross-unit collaboration opportunities.\u003c/p\u003e\u003cp\u003eWe are a large academic library providing a broad range of collections and services while supporting diverse audience segments, including undergraduate students, graduate students, faculty, staff, community users, and donors. We strive to build elegant, intuitive products that help users achieve their academic and personal goals. Our environment is supportive, collaborative, consensus-driven, and we value continuous learning. Visit the University Libraries website to learn more about us. A hybrid work arrangement is possible for this role. This role collaborates with team members who may be onsite or remote.\u003c/p\u003e\u003cp\u003e\u003cem\u003eOutstanding UA benefits include health, dental, and vision insurance plans; life insurance and disability programs; paid vacation, sick leave, and holidays; UA/ASU/NAU tuition reduction for the employee and qualified family members; state and optional retirement plans; access to UA recreation and cultural activities; and more!\u003c/em\u003e\u003c/p\u003e\u003cp\u003eThe University of Arizona has been recognized for our innovative work-life programs. For more information about working at the University of Arizona and relocations services, please\u0026nbsp;\u003ca target=\"_blank\" href=\"http://talent.arizona.edu/\"\u003e\u003cstrong\u003eclick here\u003c/strong\u003e\u003c/a\u003e.\u003cbr /\u003e\u0026nbsp;\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eCHARACTERISTIC DUTIES\u003c/strong\u003e\u003c/p\u003e\u003cul\u003e\u003cli\u003eManage projects in the areas of software development, operations, or other types of IT work.\u003c/li\u003e\u003cli\u003eDefine and evaluate project milestones, requirements, scope, and objectives.\u003c/li\u003e\u003cli\u003eDevelop relevant plans, schedules, status updates, or other tools for coordination.\u003c/li\u003e\u003cli\u003eAct as a project\u0026#39;s single point of contact for stakeholders across the organization.\u003c/li\u003e\u003cli\u003eFacilitate project communication and help describe, track, and organize technical work.\u003c/li\u003e\u003cli\u003eCreate and maintain documentation related to our projects and products.\u003c/li\u003e\u003cli\u003eMonitor and share environment information to inform decisions (e.g. projects happening in central IT that affect library IT work).\u003c/li\u003e\u003cli\u003eContinuously improve your skills and knowledge of field.\u003c/li\u003e\u003cli\u003eThe UA Libraries support the UA\u0026rsquo;s diversity and inclusiveness strategic initiatives designed to create an inclusive environment for all faculty, staff, and students. The candidate is expected to support diversity and inclusiveness efforts in the department and college.\u003c/li\u003e\u003cli\u003eOther duties as assigned.\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e\u003cstrong\u003eKNOWLEDGE, SKILLS, AND ABILITIES\u003c/strong\u003e\u003c/p\u003e\u003cul\u003e\u003cli\u003eKnowledge of general concepts, principles, and practices of project management.\u003c/li\u003e\u003cli\u003eKnowledge of agile principles and tools, Kanban, and/or lean project management processes.\u003c/li\u003e\u003cli\u003eKnowledge of user experience design, research, and related processes.\u003c/li\u003e\u003cli\u003eAbility to describe IT work for technical and non-technical audiences.\u003c/li\u003e\u003cli\u003eAbility to summarize and share project updates with a broad audience (e.g. all library staff).\u003c/li\u003e\u003cli\u003eAbility to help others develop project management expertise (e.g. by providing training, templates, tools, or facilitating communities of practice).\u003c/li\u003e\u003cli\u003eAbility to work in a highly collaborative and inclusive environment, one that values and leverages the benefits of diverse perspectives.\u003c/li\u003e\u003cli\u003ePositive attitude and strong demonstration of Our Values: Collaboration, Continuous Learning, Diversity, Innovation, and Integrity.\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e\u003cstrong\u003eMinimum Qualifications\u003c/strong\u003e\u003c/p\u003e\u003cul\u003e\u003cli\u003eBachelor\u0026#39;s degree or equivalent advanced learning attained through professional level experience and 3 years of relevant work experience required or any equivalent combination of experience, training, and/or education.\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e\u003cstrong\u003ePreferred Qualifications\u003c/strong\u003e\u003c/p\u003e\u003cul\u003e\u003cli\u003eExperience coordinating or implementing projects in the areas of software development, operations, or other types of IT work.\u003c/li\u003e\u003cli\u003eExperience with scheduling, coordinating, facilitating, and tracking meetings and other asynchronous conversations.\u003c/li\u003e\u003cli\u003eExperience writing documents which support projects (e.g. plans, project charges, status updates).\u003c/li\u003e\u003cli\u003eExperience with tools and practices which encourage collaboration within and across teams.\u003c/li\u003e\u003cli\u003eExperience in a higher education, library, or other consensus-driven environment.\u003c/li\u003e\u003c/ul\u003e",
                "job_type": "full_time",
                "telecommute": false,
                "location": "Tucson, AZ",
                "contact": "Armando Cruz\r\narmandocruz@arizona.edu",
                "published": true,
                "created_at": "2023-04-21T23:27:22.981Z",
                "updated_at": "2023-04-27T01:34:27.086Z",
                "published_at": "2023-04-27T01:34:27.085Z"
            },
            "relationships": {
                "employer": {
                    "links": {
                        "self": "https://jobs.code4lib.org/employers/university-of-arizona-libraries"
                    },
                    "data": {
                        "id": 1695,
                        "name": "University of Arizona Libraries"
                    }
                }
            },
            "links": {
                "self": "https://jobs.code4lib.org/jobs/57154-it-project-manager-ii"
            }
        },
        {
            "id": 57141,
            "attributes": {
                "title": "App Developer",
                "origin": "https://jobs.code4lib.org/jobs",
                "url": "https://www.usajobs.gov/job/720849300",
                "description": "\u003cp\u003eThe position serves as a technical expert in the design, development, testing, implementation and support of Library platforms and applications for the Library of Congress, including support for the FOLIO library platform. \u0026nbsp;This position is located in the IT Design and Development Directorate. The work of this position involves analysis, design, programming, testing, implementation and support of Web-based applications supporting the FOLIO-based Library Collections Access Platform (LCAP), and integrated applications supporting acquisitions, authentication, cataloging, digital collections, discovery and more.\u003c/p\u003e\u003cp\u003eIndependently designs, programs, tests, and integrates related software components into a Library platform that meets user requirements. Upgrades and enhances existing applications, implements new applications, and integrates applications with existing or new COTS applications, including FOLIO.\u003c/p\u003e",
                "job_type": "full_time",
                "telecommute": true,
                "location": "",
                "contact": "Phone: 202-707-5620\r\nEmail: JobHelp@loc.gov\r\nAddress:\r\nLIBRARY OF CONGRESS\r\nHuman Resources Dept.\r\n101 Independence Ave. SE\r\nLM107\r\nWashington, DC 20540-2700",
                "published": true,
                "created_at": "2023-04-20T22:33:14.878Z",
                "updated_at": "2023-04-27T01:34:10.742Z",
                "published_at": "2023-04-27T01:34:10.742Z"
            },
            "relationships": {
                "employer": {
                    "links": {
                        "self": "https://jobs.code4lib.org/employers/library-of-congress-office-of-the-chief-information-officer"
                    },
                    "data": {
                        "id": 241420,
                        "name": "Library of Congress, Office of the Chief Information Officer"
                    }
                }
            },
            "links": {
                "self": "https://jobs.code4lib.org/jobs/57141-app-developer"
            }
        },
        {
            "id": 57139,
            "attributes": {
                "title": "Director - Library Technology",
                "origin": "https://jobs.code4lib.org/jobs",
                "url": "https://careers.mtsu.edu/en-us/job/497362/director-library-technology",
                "description": "\u003cp\u003eProvides leadership, direction, and management for Library Technology in the James E. Walker Library. This position is vital in contributing to the library\u0026rsquo;s strategic priorities through the development and implementation of innovative enterprise and educational technology that advances the delivery of services and support to the MTSU community. It explores emerging technologies relevant to accomplishing the library and university mission of experiential and continuous learning. Directly supervises three full-time personnel and oversees management of four additional full-time personnel and a team of 45+ student employees. Clearly communicates expectations, completes evaluations, and guides performance, professional development, and training for the department. Responsible for the selection, design, and implementation of the library\u0026rsquo;s extensive and complex public and staff computing environments as well as the MakerSpace. Develops and monitors the Library Technology department budget; assures effective desktop support for staff and public end users. Actively engages and contributes to the Library\u0026rsquo;s Leadership Team. Facilitates communication of library technology priorities with campus technology committees and other campus IT units. Applies effective project management and problem-solving strategies to accomplish the work of the department. Responsible for determining library server and storage requirements, technology disaster recovery strategies as well as privacy and security measures that align with MTSU policy.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eRequired Education:\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eBachelor\u0026rsquo;s degree or higher in computer science, information science/systems/technology or a related field.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eRequired Related Experience:\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eBachelor\u0026rsquo;s degree with 8 years in IT management and 3 years supervision or master\u0026rsquo;s degree or higher with 5 years in IT management and 3 years supervision.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eDesirable Related Experience:\u003c/strong\u003e\u003c/p\u003e\u003cp\u003ePrior experience managing technology in a complex higher education organization preferred. Prior experience in an academic library preferred. Knowledge or experience with open-source projects and/or tools.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eApplication Review Date:\u003c/strong\u003e\u0026nbsp; June 1, 2023; for optimal consideration, please apply before May 17, 2023.\u003c/p\u003e\u003cp\u003e\u0026nbsp;\u003c/p\u003e\u003cp\u003e\u0026nbsp;\u003c/p\u003e\u003cp\u003e\u0026nbsp;\u003c/p\u003e",
                "job_type": "full_time",
                "telecommute": false,
                "location": "Murfreesboro, Tennessee",
                "contact": "Christy Groves, Associate Dean, Walker Library\r\nchristy.groves@mtsu.edu",
                "published": true,
                "created_at": "2023-04-20T16:43:20.714Z",
                "updated_at": "2023-04-20T16:51:33.171Z",
                "published_at": "2023-04-20T16:51:33.169Z"
            },
            "relationships": {
                "employer": {
                    "links": {
                        "self": "https://jobs.code4lib.org/employers/middle-tennessee-state-university-james-e-walker-library"
                    },
                    "data": {
                        "id": 231094,
                        "name": "Middle Tennessee State University  - James E. Walker Library"
                    }
                }
            },
            "links": {
                "self": "https://jobs.code4lib.org/jobs/57139-director-library-technology"
            }
        },
        {
            "id": 57135,
            "attributes": {
                "title": "Evergreen Specialist (DevOps) - Remote from anywhere in Western Canada",
                "origin": "https://jobs.code4lib.org/jobs",
                "url": "https://bc.libraries.coop/about/job-postings/",
                "description": "\u003cp\u003e\u003cstrong\u003ePosition\u003c/strong\u003e: Evergreen Specialist (DevOps)\u0026nbsp;\u0026nbsp;\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eOrganization\u003c/strong\u003e: BC Libraries Cooperative\u0026nbsp;\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eLocation\u003c/strong\u003e: Remote from anywhere in Western Canada with access to high-speed internet\u0026nbsp;\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eType of position\u003c/strong\u003e: Full-time (35 hours/week), 3-year term, with possibility of extension\u0026nbsp;\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eCompensation\u003c/strong\u003e: $68,000-$73,000, depending on experience\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eClosing date\u003c/strong\u003e: \u003cstrong\u003eWednesday, May 10, 2023, at midnight Pacific Time\u003c/strong\u003e\u0026nbsp;\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eABOUT US\u0026nbsp;\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eThe BC Libraries Cooperative (BCLC) is a mission-driven non-profit cooperative that helps libraries help people.\u0026nbsp;\u003c/p\u003e\u003cp\u003eOur 200+ members include public and post-secondary libraries and institutions across Canada. We provide libraries and related organizations with the services, cost savings, and support they need to do great work in their communities. We provide several online services for our members which include a focus on using open-source technology and systems, as well as expanding work in the field of accessible publishing that supports people in Canada with print disabilities.\u0026nbsp;\u003c/p\u003e\u003cp\u003eBCLC has a distributed workforce of over 40 people working across three time zones.\u0026nbsp;\u003c/p\u003e\u003cp\u003eFor a detailed overview of our work at the BCLC see: \u003ca target=\"_blank\" href=\"https://bc.libraries.coop/about/\"\u003ehttps://bc.libraries.coop/about/\u003c/a\u003e \u0026nbsp;\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eABOUT THE ROLE\u003c/strong\u003e\u0026nbsp;\u003c/p\u003e\u003cp\u003eThe Evergreen Specialist will work closely with the Lead Evergreen Specialist, in consultation with a Support team, to assist in maintaining BCLC\u0026rsquo;s instance of the \u003ca target=\"_blank\" href=\"https://bc.libraries.coop/services/sitka/\"\u003eEvergreen \u003c/a\u003eOpen Source Integrated Library System (ILS) and in the development of new features and fixes. The role will also require involvement with the wider Evergreen Open Source ILS community.\u0026nbsp;\u003c/p\u003e\u003cp\u003eBCLC\u0026rsquo;s consortial instance of the Evergreen ILS is known as \u0026ldquo;Sitka\u0026rsquo;\u0026rsquo;. Sitka\u0026rsquo;s Evergreen consortium includes over 100 multitype (public, post-secondary, K-12, special and government) libraries, in over 200 locations, primarily in BC and Manitoba.\u0026nbsp;\u003c/p\u003e\u003cp\u003eSpecifically, the Evergreen Specialist will:\u0026nbsp;\u003c/p\u003e\u003cul\u003e\u003cli\u003e\u003cp\u003erespond to support requests by investigating problems and answering technical questions\u0026nbsp;\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003efix bugs and develop new features\u0026nbsp;\u003c/p\u003e\u003c/li\u003e\u003c/ul\u003e\u003cul\u003e\u003cli\u003e\u003cp\u003eproactively maintain services by deploying changes and upgrades to the Evergreen software stack\u0026nbsp;\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eparticipate in the broader Evergreen development community\u0026nbsp;\u003c/p\u003e\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e\u0026nbsp;\u003cstrong\u003e\u0026nbsp;SKILLS, QUALIFICATIONS AND EXPERIENCE REQUIRED\u0026nbsp;\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eExperience with several of the following technologies/practices is preferred:\u0026nbsp;\u003cbr /\u003e\u0026nbsp;\u003c/p\u003e\u003cul\u003e\u003cli\u003e\u003cp\u003eLInux command line\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003ePerl or other programming languages (Python, PHP, etc.)\u0026nbsp;\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eSQL and relational database systems, especially PostgreSQL\u0026nbsp;\u003c/p\u003e\u003c/li\u003e\u003c/ul\u003e\u003cul\u003e\u003cli\u003e\u003cp\u003eAngular or other JavaScript-based web frameworks\u0026nbsp;\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eApache, nginx, or other web servers\u0026nbsp;\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eJSON-based web services\u0026nbsp;\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eVersion control, testing, and continuous delivery\u0026nbsp;\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eAbility to communicate technical ideas effectively to a non-technical audience\u0026nbsp;\u003c/p\u003e\u003c/li\u003e\u003c/ul\u003e\u003cul\u003e\u003cli\u003e\u003cp\u003eAbility to work effectively remotely\u0026nbsp;\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eDemonstrated capacity for self-directed learning, showing initiative, and quickly adopting new technologies\u0026nbsp;\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eDemonstrated contribution to open source projects\u0026nbsp;\u003c/p\u003e\u003c/li\u003e\u003c/ul\u003e\u003cp\u003eAn MLIS or library \u0026amp; information technician diploma \u003cstrong\u003eor\u003c/strong\u003e several years of library-related work experience is strongly preferred.\u003c/p\u003e\u003cp\u003eExperience with Evergreen or other integrated library systems/library services platforms would be a major asset.\u0026nbsp;\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eADDITIONAL SKILLS AND ABILITIES REQUIRED TO PERFORM DUTIES\u0026nbsp;\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eThe Evergreen Specialist will work closely with staff on the Sitka and Support teams, as well as staff from other BCLC service teams. The role requires a strong customer service attitude when communicating with member library staff, vendors, and other partner organizations. The ideal candidate will also have a strong commitment to the values and approaches that inform the Co-op\u0026rsquo;s work.\u0026nbsp;\u003c/p\u003e\u003cul\u003e\u003cli\u003e\u003cp\u003eCollaboration - Ability to work collaboratively with staff, members, and external service providers, support effective team processes and establish positive relationships within and outside of the organization.\u0026nbsp;\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eIntegrity - Good judgement, ethics, and awareness of privacy and security requirements.\u0026nbsp;\u003c/p\u003e\u003c/li\u003e\u003c/ul\u003e\u003cul\u003e\u003cli\u003e\u003cp\u003eCommunication \u0026ndash; Strong interpersonal and communication skills (written, oral)\u0026nbsp;\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eTime Management - Ability to effectively manage time and priorities in a dynamic remote work environment.\u0026nbsp;\u003c/p\u003e\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e\u003cstrong\u003eCOMPENSATION PACKAGE\u0026nbsp;\u003c/strong\u003e\u003c/p\u003e\u003cul\u003e\u003cli\u003e\u003cp\u003eThis is a 3-year term position, with the possibility of extension, subject to funding.\u0026nbsp;\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eThis is a full-time remote position (35 hours per week). The compensation range is $68,000-$73,000 annually, depending on experience.\u0026nbsp;\u0026nbsp;\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eWhile the candidate will work primarily regular business hours Monday-Friday, there will be some occasional evening and weekend hours required for regular maintenance windows and planned upgrades.\u0026nbsp;\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eBCLC\u0026nbsp;staff work remotely, from home offices. We have a Bring Your Own Device environment, with an allowance of $75/month to cover home office requirements. Access to high-speed internet is a requirement.\u0026nbsp;\u003c/p\u003e\u003c/li\u003e\u003c/ul\u003e\u003cul\u003e\u003cli\u003e\u003cp\u003eThe successful candidate will be enrolled in the Municipal Pension Plan, a defined benefit pension plan.\u0026nbsp;\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eBCLC has family friendly workplace policies including a generous annual vacation allotment, which starts at 20 days per year, with additional days accruing with years of service, a week\u0026rsquo;s closure in late December, 10 personal days a year, and a work culture that supports staff well-being.\u0026nbsp;\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eAfter a 90-day holdback period, there is enrollment in an employer-paid extended medical and dental package for employees and their dependants that includes a health spending account.\u0026nbsp;\u003c/p\u003e\u003c/li\u003e\u003c/ul\u003e\u003cp\u003eWe are committed to creating a diverse, equitable and inclusive workforce. We encourage women, people of Indigenous ancestry, people of colour, 2SLGBTQQIA+ individuals, people with disabilities and members of other equity-deserving groups to apply for careers with our organization.\u0026nbsp;\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eAPPLICATION PROCESS\u0026nbsp;\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eInterested applicants should submit their cover letter and resume to \u003ca target=\"_blank\" href=\"mailto:office@bc.libraries.coop\"\u003eoffice@bc.libraries.coop\u003c/a\u003e.\u0026nbsp;\u003c/p\u003e\u003cp\u003eWhen submitting your application please name and save your attachments with your first and last name in the title, such as:\u0026nbsp;\u0026nbsp;\u003c/p\u003e\u003cp\u003e\u0026ldquo;FirstnameLastname Resume Evergreen Specialist.pdf\u0026rdquo; and \u0026ldquo;FirstnameLastname Cover Letter Evergreen Specialist.pdf\u0026rdquo;\u0026nbsp;\u003c/p\u003e\u003cp\u003eOnly those candidates who are short-listed will be contacted. \u003cstrong\u003e\u003cem\u003eInterviews will be held via video conference in mid-late May with an anticipated start date in June.\u0026nbsp;\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eThe posting is also available at: \u003ca target=\"_blank\" href=\"https://bc.libraries.coop/about/job-postings/evergreen-specialist-devops-remote-closing-may-10-2023/\"\u003ehttps://bc.libraries.coop/about/job-postings/evergreen-specialist-devops-remote-closing-may-10-2023/\u003c/a\u003e\u0026nbsp;\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eThe application deadline is Wednesday, May 10, 2023, at midnight\u0026nbsp;Pacific\u003c/strong\u003e\u003c/p\u003e",
                "job_type": "full_time",
                "telecommute": true,
                "location": "Remote from anywhere in Western Canada",
                "contact": "Sharon Herbert, Deputy Director, BCLC\r\nSharon.Herbert@bc.libraries.coop\r\n(email only please)",
                "published": true,
                "created_at": "2023-04-19T23:18:39.859Z",
                "updated_at": "2023-04-20T16:51:34.727Z",
                "published_at": "2023-04-20T16:51:34.726Z"
            },
            "relationships": {
                "employer": {
                    "links": {
                        "self": "https://jobs.code4lib.org/employers/bc-libraries-cooperative"
                    },
                    "data": {
                        "id": 42,
                        "name": "BC Libraries Cooperative"
                    }
                }
            },
            "links": {
                "self": "https://jobs.code4lib.org/jobs/57135-evergreen-specialist-devops-remote-from-anywhere-in-western-canada"
            }
        },
        {
            "id": 57130,
            "attributes": {
                "title": "Manager, Research and High-Performance Computing",
                "origin": "https://jobs.code4lib.org/jobs",
                "url": "https://apply.interfolio.com/121826",
                "description": "\u003cp\u003eLafayette College seeks a service- and communication-oriented Research and High-performance Computing Manager to join its Learning and Research Technologies team. As part of the Division of Information Technology Services, this role serves as a technical expert on the College\u0026rsquo;s research computing systems and services. This role, in conjunction with the Research Computing Systems Administrator, is responsible for maintaining existing capabilities, and developing new functionality.\u003c/p\u003e\u003cp\u003eThis position will collaborate closely with faculty, staff, students, and partners at other institutions to provide broad computational support for research and teaching. This role functions within a dynamic, supportive team environment that permits diverse backgrounds to thrive, including recent graduates, people wanting to make a career change, or those with non-traditional career tracks, educational paths, or life experiences.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003ePrimary Duties and Responsibilities\u003c/strong\u003e\u003cbr /\u003ePrimary duties and responsibilities are as follows, though not necessarily inclusive:\u003cbr /\u003e● Consulting with faculty, staff, and students, helping them to make the best possible use of research computing systems and services.\u003cbr /\u003e● Working with stakeholders to identify and resolve technical obstacles to the work of Lafayette\u0026rsquo;s computing-intensive and data-intensive research and education community.\u003cbr /\u003e● Partnering with campus constituents to identify and understand research and education activities that can benefit from research cyberinfrastructure, not only at Lafayette but also at other institutions, for example at national supercomputing centers.\u003cbr /\u003e● Engaging users to help develop and optimize workflows that effectively and efficiently use research computing systems and services.\u003cbr /\u003e● Exploring new opportunities/use cases and partnerships, assisting in grant proposal development, and presenting papers, talks, posters, and similar content at local, regional, and national meetings.\u003cbr /\u003e● Supervising, mentoring, and working collaboratively with the Research Computing Systems Administrator.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eKnowledge and Skills\u003c/strong\u003e\u003cbr /\u003eApplicants with at least some of the following are encouraged to apply:\u003cbr /\u003e● An ability to talk articulately and kindly with researchers possessing varying technical backgrounds.\u003cbr /\u003e● A passion and curiosity for research and cyberinfrastructure.\u003cbr /\u003e● A desire and ability to collaborate with colleagues at the College in addition to colleagues from regional and national institutions to ensure the College\u0026rsquo;s research cyberinfrastructure is meeting the needs of its researchers.\u003cbr /\u003e● An ability to adapt to an ever-changing technical environment requiring the ability to apply personal strengths as well as explore opportunities for growth.\u003cbr /\u003e● A strong desire for continued learning about new technologies and practices to further improve the College\u0026rsquo;s research cyberinfrastructure.\u003cbr /\u003e● Comfort creating and leading presentations and workshops for faculty, staff, and students locally, regionally, and nationally.\u003c/p\u003e\u003cp\u003eIf this environment sounds like a strong match, or even an exciting challenge, we encourage you to apply and to use your cover letter to explain how you might be a good fit for the role. Please submit a resume, cover letter, and names and contact information for three references by May 1st, 2023.\u0026nbsp;\u003ca href=\"http://apply.interfolio.com/121826\"\u003ehttp://apply.interfolio.com/121826\u003c/a\u003e\u003c/p\u003e",
                "job_type": "full_time",
                "telecommute": false,
                "location": "Easton, PA",
                "contact": "",
                "published": true,
                "created_at": "2023-04-19T15:46:48.225Z",
                "updated_at": "2023-04-20T16:51:35.854Z",
                "published_at": "2023-04-20T16:51:35.853Z"
            },
            "relationships": {
                "employer": {
                    "links": {
                        "self": "https://jobs.code4lib.org/employers/lafayette-college"
                    },
                    "data": {
                        "id": 570,
                        "name": "Lafayette College"
                    }
                }
            },
            "links": {
                "self": "https://jobs.code4lib.org/jobs/57130-manager-research-and-high-performance-computing"
            }
        },
        {
            "id": 57128,
            "attributes": {
                "title": "Digital Records Archivist",
                "origin": "https://jobs.code4lib.org/jobs",
                "url": "http://z.umn.edu/ulib464",
                "description": "\u003cp\u003eThe University of Minnesota Libraries seeks an innovative and collaborative individual for the position of Digital Records Archivist in the University Minnesota Archives. The Digital Records Archivist serves a core operational role and provides measurable impact for the University of Minnesota in developing and sustaining the preservation of digital records and publications through a variety of approaches, including the University of Minnesota\u0026#39;s institutional repository, the University Digital Conservancy (UDC); the University of Minnesota web archiving program; and the digital records program of the University Archives. The Digital Records Archivist is part of a team within the University Archives and works closely with the Libraries\u0026#39; Digital Preservation and Repository Technologies unit and Electronic Records Management Group.\u003c/p\u003e\u003cp\u003eThe position reports to the University Archivist and Director of the University Digital Conservancy. The University of Minnesota Archives is the official records repository of the University of Minnesota with mandated responsibility for the historically valuable documentation of University units and individuals, including faculty, staff, and administrators in all formats and media. The University Digital Conservancy (UDC) is a systemwide institutional repository for digital records and publications produced or sponsored by administrative and academic units. The UDC serves as the digital arm of the University Archives in support of the Libraries\u0026#39; mission of creating and sharing knowledge through broad access to information resources in published or unpublished form and made accessible to all members of the University community and the broader state and global community. The University Archives is located in the Elmer L. Andersen Library on the West Bank campus of the University of Minnesota, Twin Cities.\u003c/p\u003e\u003cp\u003eThis is a full-time, 12-month, annual renewable professional academic position. The minimum salary for this position is $58,500. \u0026nbsp;The Libraries offer a competitive salary commensurate with experience. Excellent benefits. Up to one-month salary moving allowance.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eMajor Responsibilities\u003c/strong\u003e\u003c/p\u003e\u003cul\u003e\u003cli\u003eProvides timely operational management of the institutional repository and coordination of services with a systemwide team of archivists and librarians to sustain an institutional repository program and to collect digital records and publications.\u003c/li\u003e\u003cli\u003eContributes to policies and procedures for digital records and publications added to the repository and the University Archives, including the discussion of metadata standards, the migration of formats, identifying issues of content retrieval and sharing, the application of federal laws and university policies, and digital preservation.\u003c/li\u003e\u003cli\u003eOversees the web archiving program for the university and identifies web-based content for inclusion in the UDC or University Archives.\u003c/li\u003e\u003cli\u003eProvides digital appraisal services for administrators, faculty, and campus units to identify at-risk digital records that merit sustained access and develops workflows to ingest and describe the digital content within the UDC or the digital records program of the University Archives.\u003c/li\u003e\u003cli\u003eEnhances public engagement and transparency through collaborating with university offices, departments, and programs to capture and preserve institutional digital records that document university functions and initiatives for public accountability and of historical significance.\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e\u003cstrong\u003eQualifications\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eRequired:\u003c/p\u003e\u003cul\u003e\u003cli\u003eMasters degree from an American Library Association accredited library school or an advanced degree with relevant experience.\u003c/li\u003e\u003cli\u003eExperience working with repository platforms or content management systems.\u003c/li\u003e\u003cli\u003eDemonstrated understanding of digital records ingest, processing, and preservation strategies.\u003c/li\u003e\u003cli\u003eExperience with web archiving methods.\u003c/li\u003e\u003cli\u003eDemonstrated ability to support, respect, and commit to embracing diverse backgrounds, values, and points of view in order to build an environment that fosters an inclusive community.\u003c/li\u003e\u003c/ul\u003e\u003cp\u003ePreferred:\u003c/p\u003e\u003cul\u003e\u003cli\u003eExperience in project management and process documentation.\u003c/li\u003e\u003cli\u003eProficiency with metadata management tools (e.g., MS Excel, OpenRefine)\u003c/li\u003e\u003cli\u003eFamiliarity with metadata standards and archival description practices.\u003c/li\u003e\u003cli\u003eFacility in the use of technology or API development.\u003c/li\u003e\u003cli\u003eKeen interest in problem-solving and analytical solutions.\u003c/li\u003e\u003cli\u003eAbility to work effectively independently and in cooperation with colleagues in a service-oriented, collaborative environment.\u003c/li\u003e\u003c/ul\u003e\u003cp\u003eFor more information about the position\u0026#39;s responsibilities and to apply, please visit: \u003ca href=\"http://z.umn.edu/ulib464\"\u003ehttp://z.umn.edu/ulib464\u003c/a\u003e.\u0026nbsp;\u003c/p\u003e",
                "job_type": "full_time",
                "telecommute": false,
                "location": "Minneapolis, MN",
                "contact": "",
                "published": true,
                "created_at": "2023-04-19T12:30:47.573Z",
                "updated_at": "2023-04-20T16:51:36.780Z",
                "published_at": "2023-04-20T16:51:36.780Z"
            },
            "relationships": {
                "employer": {
                    "links": {
                        "self": "https://jobs.code4lib.org/employers/university-of-minnesota-libraries-twin-cities-campus"
                    },
                    "data": {
                        "id": 1708,
                        "name": "University of Minnesota Libraries - Twin Cities Campus"
                    }
                }
            },
            "links": {
                "self": "https://jobs.code4lib.org/jobs/57128-digital-records-archivist"
            }
        },
        {
            "id": 57116,
            "attributes": {
                "title": "Web Applications Developer",
                "origin": "https://jobs.code4lib.org/jobs",
                "url": "https://www.lib.ncsu.edu/jobs/ehratech/web-applications-developer",
                "description": "\u003cp\u003eThe NC State University Libraries invites applications and nominations for the position of Web Applications Developer in the Digital Library Initiatives department. The Digital Library Initiatives (DLI) department applies systems analysis, design, service development, and software development skills to the creation and improvement of a broad range of library products and services.\u0026nbsp;\u003c/p\u003e\u003cp\u003eDLI develops and supports the core systems that provide access to the NC State University Libraries\u0026rsquo; print and electronic resources, including SirsiDynix Symphony, ILLiad, the Blacklight catalog, EZproxy, and the CORAL electronic resources management system. We support open source and locally developed applications that promote resource discovery and delivery, enable use of Libraries\u0026rsquo; spaces, and improve staff workflows.\u0026nbsp;\u003c/p\u003e\u003cp\u003eThe department maintains a broad portfolio of prototype and production systems and services and is currently developing new initiatives in areas including digital collections, high-technology spaces, researcher profiles and identifiers, machine learning, and assessment and analytics. The department develops new research infrastructure support services focused on improving the efficiency and productivity of NC State researchers in collaboration with campus units like the Office of Information Technology, research administrators, and university IT staff.\u0026nbsp;\u003c/p\u003e\u003cp\u003eWe collaborate with stakeholders throughout the Libraries, university, and consortial partners. We look for opportunities to meet the challenges of libraries and archives in novel ways. The department has produced a number of unique, widely used, open source systems to improve service to library users, including the Suma space assessment toolkit, the QuickSearch bento-box-style, single-search system, and the Circa request management system for archives.\u0026nbsp;\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eResponsibilities\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eThe Web Applications Developer works within the Discovery Systems unit of the DLI department. The incumbent works with functional stakeholders across the Libraries to identify user needs and implement solutions that solve unique technical challenges and improve user experience. They support several key Libraries services, including the provision of electronic reserves to faculty and students across the university. Responsibilities include architecting, developing, and supporting new and active applications, selecting and deploying web frameworks, and implementing automated testing and configuration management as appropriate. Discovery Systems supports a wide range of applications spanning multiple programming languages including PHP, Python, Ruby, and Java; the incumbent will be matched with a portfolio based on their existing skills and development goals. The position reports to the Discovery Systems Manager.\u003c/p\u003e",
                "job_type": "full_time",
                "telecommute": false,
                "location": "Raleigh, NC",
                "contact": "",
                "published": true,
                "created_at": "2023-04-18T17:29:29.023Z",
                "updated_at": "2023-04-20T16:51:37.572Z",
                "published_at": "2023-04-20T16:51:37.571Z"
            },
            "relationships": {
                "employer": {
                    "links": {
                        "self": "https://jobs.code4lib.org/employers/north-carolina-state-university-libraries"
                    },
                    "data": {
                        "id": 26205,
                        "name": "North Carolina State University Libraries"
                    }
                }
            },
            "links": {
                "self": "https://jobs.code4lib.org/jobs/57116-web-applications-developer"
            }
        },
        {
            "id": 57115,
            "attributes": {
                "title": "Research and Data Services Librarian",
                "origin": "https://jobs.code4lib.org/jobs",
                "url": "http://apply.interfolio.com/120353",
                "description": "\u003cp\u003eThe D\u0026#39;Angelo Law Library seeks a collaborative, future-oriented specialist in empirical research and academic scholarship for the Research and Data Services Librarian position. Reporting to the Associate Director for User Services at the D\u0026#39;Angelo Law Library, the Research and Data Services Librarian creates and delivers programs to support data-driven research in law.\u003c/p\u003e\u003cp\u003eAs the home of the law and economics discipline, the University of Chicago Law School faculty engage in interdisciplinary, innovative empirical research. Through collaboration with the Law School\u0026#39;s research centers, including the Coase-Sandor Institute of Law and Economics, this position supports faculty research and provides reference expertise in the discovery and use of data resources in empirical legal scholarship. The Research and Data Services Librarian participates in Library-wide discussions and collaborations on data services for research, monitors and communicates about issues in scholarly services for law researchers, and works to support data management, research data preservation, and open access to scholarship.\u003c/p\u003e\u003cp\u003eIn addition to supporting empirical legal scholarship, the Research and Data Services Librarian works with Library and Law School colleagues to ensure D\u0026#39;Angelo\u0026#39;s development and maintenance of the Law School\u0026#39;s repository, Chicago Unbound, the ongoing discovery and curation of scholarship in the faculty citation database, and the sharing of faculty publications content from the repository and the database. The Research and Data Services Librarian serves as a member of the D\u0026#39;Angelo reference team, provides in-person and virtual reference assistance, provides training, and creates and maintains guides and other resources for researchers. As part of the D\u0026#39;Angelo Law Library User Services department, the Research and Data Services Librarian provides outstanding research and learning services to the Law School and University communities.\u003c/p\u003e\u003cp\u003eThe D\u0026#39;Angelo Law Library contributes to the academic and scholarly success of the University of Chicago and Law School communities by providing rich collections and resources, maintaining a premier scholarly environment, and delivering superior library services. D\u0026#39;Angelo\u0026#39;s collections are among the world\u0026#39;s finest for law research and enable comprehensive access to legal scholarship and interdisciplinary resources. D\u0026#39;Angelo occupies five floors in the central tower of the Law School\u0026#39;s Laird Bell Quadrangle and is a valued partner in the Law School\u0026#39;s community of scholarship, teaching, and learning. The D\u0026#39;Angelo Law Library is part of the University of Chicago Library system, working cooperatively with other campus libraries to ensure rapid access to print and digital collections, research and study spaces, and expansive services. D\u0026#39;Angelo team members foster and maintain a collaborative, inclusive, and supportive workplace culture to provide the highest level of service to the prolific and evolving University of Chicago Law School and University communities.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eQualifications\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eRequired:\u003c/strong\u003e\u003c/p\u003e\u003cul\u003e\u003cli\u003eJuris Doctor (J.D.) from an ABA-accredited law school, a graduate degree in the social sciences or a related discipline, or a Master\u0026rsquo;s degree in library science or graduate library degree from an ALA-accredited library school\u003c/li\u003e\u003cli\u003eExperience with data research tools, statistical analysis software, and empirical research methodologies in law or social science disciplines\u003c/li\u003e\u003cli\u003eKnowledge of law sources and databases as evidenced by relevant course work, work experience, or other related experience\u003c/li\u003e\u003cli\u003eKnowledge of and experience working with relational databases, including the ability to extract data, run queries for information, and generate reports\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e\u003cstrong\u003ePreferred:\u003c/strong\u003e\u003c/p\u003e\u003cul\u003e\u003cli\u003eAwareness of current issues and trends regarding scholarly communications, institutional repositories, and rights management\u003c/li\u003e\u003cli\u003eKnowledge of current and emerging trends in legal scholarship and law publications\u003c/li\u003e\u003cli\u003eExperience performing legal research\u003c/li\u003e\u003cli\u003eExcellent communication, organizational, and planning skills; demonstrated ability to communicate effectively with faculty, students, and staff about data and technical matters\u003c/li\u003e\u003cli\u003eEvidence of initiative, a strong user service philosophy, the ability to maintain good relationships with colleagues and work in teams, and a commitment to continuous improvement and innovation\u0026nbsp;\u003c/li\u003e\u003cli\u003ePrevious experience working in a law library\u003c/li\u003e\u003cli\u003eTeaching or training experience\u003c/li\u003e\u003cli\u003eKnowledge of computer programming languages and experience writing computer code and scripts\u003c/li\u003e\u003cli\u003eDemonstrated knowledge and experience in project management\u003c/li\u003e\u003cli\u003eKnowledge of one or more non-English languages\u003c/li\u003e\u003cli\u003eExcellent interpersonal skills and the ability to work effectively with faculty, staff, and students of culturally diverse backgrounds\u0026nbsp;\u0026nbsp;\u003c/li\u003e\u003cli\u003eExcellent organizational, analytical, and communication (oral and written) skills\u0026nbsp;\u0026nbsp;\u003c/li\u003e\u003cli\u003eDemonstrated record of substantial professional achievements\u0026nbsp;\u0026nbsp;\u0026nbsp;\u003c/li\u003e\u003cli\u003eDemonstrated commitment to continuing education and active involvement in the library profession\u0026nbsp;\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e\u003cstrong\u003eApplication Instructions\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eTo Apply:\u003c/strong\u003e\u0026nbsp;Submit cover letter, curriculum vitae, and reference contact information online through the University of Chicago\u0026#39;s Academic Recruiting website:\u0026nbsp;\u003ca href=\"http://apply.interfolio.com/120353\"\u003e\u003cstrong\u003ehttp://apply.interfolio.com/120353\u003c/strong\u003e\u003c/a\u003e. Review of applications will begin\u0026nbsp;\u003cstrong\u003eafter February 23,2023\u003c/strong\u003e. Screening of applications will continue until the position is filled or the search is closed.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eSalary and Benefits:\u003c/strong\u003e\u0026nbsp;Appointment salary based on qualifications and experience. Benefits include a retirement plan, insurance, and paid time off.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eQuestions:\u0026nbsp;\u003c/strong\u003eContact Library Human Resources at\u0026nbsp;\u003ca href=\"mailto:libraryhr@uchicago.edu\"\u003elibraryhr@uchicago.edu\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eEqual Employment Opportunity Statement\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eWe seek a diverse pool of applicants who wish to join an academic community that places the highest value on rigorous inquiry and encourages diverse perspectives, experiences, groups of individuals, and ideas to inform and stimulate intellectual challenge, engagement, and exchange.\u0026nbsp;The University\u0026rsquo;s Statements on Diversity are at\u0026nbsp;\u003ca href=\"https://provost.uchicago.edu/statements-diversity\"\u003e\u003cstrong\u003ehttps://provost.uchicago.edu/statements-diversity\u003c/strong\u003e\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eThe University of Chicago is an Affirmative Action/Equal Opportunity/Disabled/Veterans Employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity, national or ethnic origin, age, status as an individual with a disability, protected veteran status, genetic information, or other protected classes under the law. For additional information please see the University\u0026#39;s\u0026nbsp;\u003ca href=\"https://www.uchicago.edu/about/non_discrimination_statement/\"\u003e\u003cstrong\u003eNotice of Nondiscrimination\u003c/strong\u003e\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eJob seekers in need of a reasonable accommodation to complete the application process should call 773-834-3988 or email\u0026nbsp;\u003ca href=\"mailto:equalopportunity@uchicago.edu\"\u003e\u003cstrong\u003eequalopportunity@uchicago.edu\u003c/strong\u003e\u003c/a\u003e\u0026nbsp;with their request.\u003c/p\u003e",
                "job_type": "full_time",
                "telecommute": false,
                "location": "Chicago, IL, USA",
                "contact": "",
                "published": true,
                "created_at": "2023-04-18T16:36:09.053Z",
                "updated_at": "2023-04-20T16:51:38.344Z",
                "published_at": "2023-04-20T16:51:38.343Z"
            },
            "relationships": {
                "employer": {
                    "links": {
                        "self": "https://jobs.code4lib.org/employers/the-university-of-chicago-d-angelo-law-library"
                    },
                    "data": {
                        "id": 125208,
                        "name": "The University of Chicago, D'Angelo Law Library"
                    }
                }
            },
            "links": {
                "self": "https://jobs.code4lib.org/jobs/57115-research-and-data-services-librarian"
            }
        },
        {
            "id": 57106,
            "attributes": {
                "title": "Systems and Discovery Librarian",
                "origin": "https://jobs.code4lib.org/jobs",
                "url": "https://employment.davidson.edu/en-us/job/494426/systems-and-discovery-librarian",
                "description": "\u003cp\u003eWorking in collaboration across library teams, you will provide robust support and help shape strategic directions for library systems and services including Davidson\u0026rsquo;s library services platform (currently Ex Libris\u0026rsquo; Alma), discovery system (currently Primo), and digital asset management system (currently Alma Digital). Using your expertise in systems and metadata management, you will play a key role in facilitating discovery and delivery of the library\u0026rsquo;s collection, and in enhancing and improving library workflows.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eIn this position, you will:\u003c/strong\u003e\u003c/p\u003e\u003cul\u003e\u003cli\u003e\u003cp\u003eServe as lead administrator for the library services platform, discovery system, information management systems, and digital asset management systems, leading configuration, user administration, and policy creation across teams.\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eProvide support, troubleshooting, training, and guidance for staff for Alma and related library systems. Support analytics and queries to generate insight into library materials, usage, circulation, space, and consortial commitments.\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eCollaborate with colleagues and with external vendors on Alma imports and exports, and partners with library colleagues on other metadata initiatives. Monitor and provide quality control over staff- and third party-provided metadata.\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eDevelop integrations between library systems such as Primo, ArchivesSpace and LibGuides to support discovery and enhance the user experience.\u0026nbsp;\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eServe as principal technical liaison with campus representatives and vendors for library discovery and related systems.\u0026nbsp;\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eSupport integration of interlibrary loan and document delivery management systems (currently ILLiad.)\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eExplore, evaluate, recommend, and implement new technologies and web applications to advance library strategic goals and enhance patron services.\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eCollaborate closely with colleagues within the library, in Technology \u0026amp; Innovation (T\u0026amp;I), and across campus on library systems and services. Serve on a variety of working groups and cross-functional teams that focus on discovery of and access to library and information resources, as well as broader committees and working groups across the library\u0026rsquo;s partnerships and consortial relationships.\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eParticipate in the overall development of the library\u0026rsquo;s efforts to provide expertise, space, resources, and services for research, access to, and creation of information to support our community.\u003c/p\u003e\u003c/li\u003e\u003c/ul\u003e",
                "job_type": "full_time",
                "telecommute": false,
                "location": "Davidson, NC",
                "contact": "",
                "published": true,
                "created_at": "2023-04-17T20:08:31.348Z",
                "updated_at": "2023-04-20T16:52:15.222Z",
                "published_at": "2023-04-20T16:52:15.221Z"
            },
            "relationships": {
                "employer": {
                    "links": {
                        "self": "https://jobs.code4lib.org/employers/davidson-college"
                    },
                    "data": {
                        "id": 254,
                        "name": "Davidson College"
                    }
                }
            },
            "links": {
                "self": "https://jobs.code4lib.org/jobs/57106-systems-and-discovery-librarian"
            }
        },
        {
            "id": 57105,
            "attributes": {
                "title": "IT Support Specialist Lead",
                "origin": "https://jobs.code4lib.org/jobs",
                "url": "https://ps.its.rochester.edu/psp/HRPRD/EMPLOYEE/HRMS/c/HRS_HRAM_FL.HRS_CG_SEARCH_FL.GBL?Page=HRS_APP_JBPST_FL\u0026Action=U\u0026SiteId=1\u0026FOCUS=Applicant\u0026JobOpeningId=244790\u0026PostingSeq=1",
                "description": "\u003cp\u003eThis position is responsible for providing high-level IT desktop and building technology support for the River Campus Libraries (RCL), as well as supporting library enterprise systems.\u0026nbsp; Duties include resolving issues related to computers, mobile devices, peripherals and audio-visual equipment; Active Directory account commissioning and decommissioning.\u0026nbsp; The incumbent will also be charged with staying current with IT equipment and trends.\u0026nbsp;\u003c/p\u003e\u003cp\u003eIt is essential that the incumbent possess a strong commitment to working in a team environment; communication is vital to this position as well as the ability to work independently.\u0026nbsp; Overseeing the delivery of top-tier customer service is a large part of the position, which includes sensitively communicating with RCL staff and facilitating positive results.\u003c/p\u003e\u003cp\u003eIn addition to IT support and customer service, this professional will lead technical projects related to emerging technologies and services which effectively support RCL research, teaching, and learning programs.\u003c/p\u003e",
                "job_type": "full_time",
                "telecommute": false,
                "location": "",
                "contact": "",
                "published": true,
                "created_at": "2023-04-17T19:58:27.506Z",
                "updated_at": "2023-04-20T16:52:13.077Z",
                "published_at": "2023-04-20T16:52:13.076Z"
            },
            "relationships": {
                "employer": {
                    "links": {
                        "self": "https://jobs.code4lib.org/employers/river-campus-libraries-university-of-rochester"
                    },
                    "data": {
                        "id": 234224,
                        "name": "River Campus Libraries, University of Rochester"
                    }
                }
            },
            "links": {
                "self": "https://jobs.code4lib.org/jobs/57105-it-support-specialist-lead"
            }
        },
        {
            "id": 57104,
            "attributes": {
                "title": "Mining Research Publications for Specimen Data",
                "origin": "https://jobs.code4lib.org/jobs",
                "url": "https://research.si.edu/wp-content/uploads/sites/6/2023/04/Smithsonian_Specimen_Data_Mining_RFQ.pdf",
                "description": "\u003cp\u003eRequest for quotes for a project to mine research publications for specimen citations.\u003cbr /\u003e\u003cbr /\u003eThe deliverable is code (Python) that will allow Smithsonian staff to query texts for the presence of citations to biological and geological specimens.\u003cbr /\u003e\u003cbr /\u003eRFQ is linked at: https://research.si.edu/wp-content/uploads/sites/6/2023/04/Smithsonian_Specimen_Data_Mining_RFQ.pdf\u003c/p\u003e",
                "job_type": "contract",
                "telecommute": true,
                "location": "Remote",
                "contact": "Alvin Hutchinson\r\nhutchinsona@si.edu",
                "published": true,
                "created_at": "2023-04-17T18:30:13.106Z",
                "updated_at": "2023-04-20T16:52:11.374Z",
                "published_at": "2023-04-20T16:52:11.373Z"
            },
            "relationships": {
                "employer": {
                    "links": {
                        "self": "https://jobs.code4lib.org/employers/smithsonian-libraries-and-archives"
                    },
                    "data": {
                        "id": 241397,
                        "name": "Smithsonian Libraries and Archives"
                    }
                }
            },
            "links": {
                "self": "https://jobs.code4lib.org/jobs/57104-mining-research-publications-for-specimen-data"
            }
        },
        {
            "id": 57102,
            "attributes": {
                "title": "Community and University Archivist",
                "origin": "https://jobs.code4lib.org/jobs",
                "url": "https://apptrkr.com/4090347",
                "description": "\u003cp\u003eCommunity and University Archivist\u003c/p\u003e\u003cp\u003eR0136179\u003c/p\u003e\u003cp\u003eUniversity of Nevada, Reno - Main Campus\u003c/p\u003e\u003cp\u003eThe University of Nevada, Reno (UNR) appreciates your interest in employment at our growing institution. We want your application process to go smoothly and quickly. Final applications must be submitted prior to the close of the recruitment.\u003c/p\u003e\u003cp\u003eIf you need assistance or have questions regarding the application process, please contact our recruitment helpline at (775) 784-1495 or https://nam04.safelinks.protection.outlook.com/?url=http%3A%2F%2Fjobs%40unr.edu%2F\u0026amp;data=04%7C01%7Cmichellebriggs%40unr.edu%7C3fc56ddb0d3143705f1c08d9932205df%7C523b4bfc0ebd4c03b2b96f6a17fd31d8%7C1%7C0%7C637702596595879550%7CUnknown%7CTWFpbGZsb3d8eyJWIjoiMC4wLjAwMDAiLCJQIjoiV2luMzIiLCJBTiI6Ik1haWwiLCJXVCI6Mn0%3D%7C1000\u0026amp;sdata=f3IzAEa5H3%2FeLS%2BymU9ZqLPkGDVrZukYCBVy8XHJYe0%3D\u0026amp;reserved=0. For UNR Med professional job postings, please contact the Office of Professional Recruitment at (775) 784-6778.\u003c/p\u003e\u003cp\u003eJob Description\u003c/p\u003e\u003cp\u003eThe University of Nevada, Reno is recruiting for a Community and University Archivist. This position, reporting to the Director of Distinctive Collections, will join the Special Collections and University Archives Department with a primary curatorial assignment focusing on the University and the western Great Basin. The Community and University Archivist (CUA) serves a vital role in assisting the University to foster its unique identity and sense of place, and document its significance to Nevada, the region, and the world. The CUA is responsible for appraisal and acquisition of materials in all formats and will provide leadership and expertise in the Libraries\u0026#39; efforts to document and preserve the history, activities, and impact of significant topical areas and regional communities.\u003c/p\u003e\u003cp\u003eThe CUA will seek out archives and special collections materials that add to or strengthen diverse voices and experiences in the department\u0026#39;s collections. The CUA will work with a wide range of staff, campus, and community partners to develop and promote the collections and the archives in support of teaching, research, and learning. The CUA will be the primary contact for collection creators, experts, and donors and is aware of and participates in national and regional theoretical, conceptual, and practical developments in the field of archival studies, and cultivates external impact in the form of service to the profession and original research.\u003c/p\u003e\u003cp\u003eThis is a tenure-track faculty position that requires scholarly activity and publication and service on professional and university committees.\u003c/p\u003e\u003cp\u003eMore information about the University Libraries\u0026#39; expectations related to faculty rank and tenure can be found in the https://www.unr.edu/faculty-senate/university-bylaws/university-libraries.\u003c/p\u003e\u003cp\u003eCommunity and University Archivist responsibilities will include:\u003c/p\u003e\u003cp\u003eProfessional Practice (70%)\u003c/p\u003e\u003cp\u003eAppraisal and Collection Development\u003c/p\u003e\u003cp\u003e\u0026bull; Recognizes monitors, and assesses historically significant cultural, organizational, and social developments pertaining to assigned areas (the University, its impact on Nevada and the region)\u003c/p\u003e\u003cp\u003e\u0026bull; Identifies, appraises, acquires and makes accessible archival materials, regardless of format, that have enduring significance and value in accordance with collection development policies\u003c/p\u003e\u003cp\u003e\u0026bull; Works closely with Digital Services to appraise and acquire web-based, email, or other born digital records\u003c/p\u003e\u003cp\u003e\u0026bull; Formulates strategic priorities for collection development, advocates priorities for collections and services pertaining to archival materials in assigned curatorial areas\u003c/p\u003e\u003cp\u003e\u0026bull; Collaborates with the Director and other staff to manage collections priorities, donor relationships, and project priorities\u003c/p\u003e\u003cp\u003eCollaboration and Community Support\u003c/p\u003e\u003cp\u003e\u0026bull; Serves as a primary expert on assigned curatorial areas\u003c/p\u003e\u003cp\u003e\u0026bull; Collaborates and builds alliances that serve the university community through the creation, acquisition, and promotion of archival collections\u003c/p\u003e\u003cp\u003e\u0026bull; Consults with and supports other staff who manage, process, provide access to, and describe archival materials\u003c/p\u003e\u003cp\u003e\u0026bull; Draws on professional expertise and collaborates with other staff to provide services and/or guidance to our stakeholder communities related to archives and recordkeeping\u003c/p\u003e\u003cp\u003eAccess and User Services\u003c/p\u003e\u003cp\u003e\u0026bull; Provides user assistance, including regular shifts at the reference desk\u003c/p\u003e\u003cp\u003e\u0026bull; Participates in the development and assessment of procedures and policies\u003c/p\u003e\u003cp\u003e\u0026bull; Other duties as assigned\u003c/p\u003e\u003cp\u003eProfessional Service (15%)\u003c/p\u003e\u003cp\u003e\u0026bull; Contribute professional expertise, knowledge, and experience to local, state, regional, and national or international professional organizations.\u003c/p\u003e\u003cp\u003eResearch and Scholarship (15%)\u003c/p\u003e\u003cp\u003e\u0026bull; Perform original research and disseminate the results through publication and/or presentation in scholarly venues.\u003c/p\u003e\u003cp\u003eRequired Qualifications\u003c/p\u003e\u003cp\u003eMLIS or related degree and three (3) years of related professional work experience\u003c/p\u003e\u003cp\u003eRelated Experience: with archival appraisal and donor relations, born-digital archival materials archival policy writing, archival collections management, and/or assessment of intellectual property rights pertaining to archival materials in a major research university.\u003c/p\u003e\u003cp\u003ePreferred Qualifications\u003c/p\u003e\u003cp\u003eWe recognize that candidates may not have all the preferred qualifications\u0026mdash;we encourage you to apply if you meet some or most of them.\u003c/p\u003e\u003cp\u003e\u0026bull; Knowledge of academic archives at land grant institutions\u003c/p\u003e\u003cp\u003e\u0026bull; Knowledge of laws and ethical standards relevant to American archival practice\u003c/p\u003e\u003cp\u003e\u0026bull; Experience with technologies and tools used in archives\u003c/p\u003e\u003cp\u003e\u0026bull; Knowledge of appraisal of complex archival materials in a variety of formats, including digital\u003c/p\u003e\u003cp\u003e\u0026bull; Experience working collaboratively and independently\u003c/p\u003e\u003cp\u003e\u0026bull; Experience writing and developing policies and procedures\u003c/p\u003e\u003cp\u003e\u0026bull; Experience communicating, serving, and collaborating across cultures and/or with people with a variety of perspectives, experiences, and identities\u003c/p\u003e\u003cp\u003eSalary\u003c/p\u003e\u003cp\u003eSalary minimum is $67,000. This is a full-time, tenure track faculty position. Appointment may be at the level of Assistant Professor or Associate Professor, depending on experience, record of scholarship, service and achievement. To view the salary schedule for this position, please visit: https://www.unr.edu/hr/compensation-evaluation/compensation/salary-schedules\u003c/p\u003e\u003cp\u003eBenefits\u003c/p\u003e\u003cp\u003e\u0026bull; https://www.unr.edu/bcn-nshe/benefits/retirement - Our retirement plan is beyond compare. Your 15.50% contribution is generously matched by the University. With the faculty retirement plan, you are 100% vested your first day. Sit back and watch your retirement dollars grow! All permanent employees on an annual \u0026quot;A\u0026quot; or \u0026quot;B\u0026quot; contract who are employed at least 50% full-time are eligible to participate in the NSHE retirement program unless they are members of PERS of Nevada. In addition, the University offers several voluntary deferred compensation programs.\u003c/p\u003e\u003cp\u003e\u0026bull; https://www.unr.edu/bcn-nshe/benefits/insurance - Health insurance options including dental and vision, life insurance and long-term disability.\u003c/p\u003e\u003cp\u003e\u0026bull; https://www.unr.edu/hr/benefits/leave-and-time-off/faculty - Generous annual and sick leave; thirty (30) days of sick leave provided upon start date and two (2) days of sick leave accrued per full month after the first year of service, two (2) days of annual leave accrued each full month.\u003c/p\u003e\u003cp\u003e\u0026bull; https://www.mountaineap.com/ - supports employees (and eligible dependents) through life\u0026#39;s difficult moments. Mountain EAP is located in Reno and specializes in counseling and advising services for personal or interpersonal issues.\u003c/p\u003e\u003cp\u003ePerks of working at UNR\u003c/p\u003e\u003cp\u003e\u0026bull; https://www.unr.edu/hr/jobs/dual-career-program - The University of Nevada, Reno recognizes the importance of addressing dual-career couples\u0026#39; professional needs. We offer a dual career assistance program to newly hired faculty spouses/partners that provides resources and assists them to identify career opportunities in Northern Nevada. Dual Career Program\u003c/p\u003e\u003cp\u003e\u0026bull; https://www.unr.edu/hr/benefits/educational-benefits/faculty - The University is proud to provide a reduced-rate tuition benefit to faculty and qualified dependents. Faculty can take up to six credits per semester at a reduced rate. Dependents of faculty have unlimited credits, but in order to be eligible children must be unmarried and under the age of 24 and must receive at least 50% of their financial support from the employee and/or employee\u0026#39;s spouse or domestic partner.\u003c/p\u003e\u003cp\u003e\u0026bull; https://www.unr.edu/fitness/memberships - E. L. Wiegand Fitness Center offers an annual or semester membership and family membership options.\u003c/p\u003e\u003cp\u003e\u0026bull; https://www.unr.edu/diversity/groups - Several Diversity Committees and Affinity Groups focusing on campus-wide diversity initiatives to ensure we are working to create a diverse and welcoming campus climate.\u003c/p\u003e\u003cp\u003e\u0026bull; https://www.unr.edu/faculty-senate - Faculty Senate is the principal representing body for faculty. Its membership includes representatives from each academic and administrative major unit of the University.\u003c/p\u003e\u003cp\u003e\u0026bull; Nevada residents do not pay state income tax.\u003c/p\u003e\u003cp\u003eAbout the University Libraries\u003c/p\u003e\u003cp\u003eThe University Libraries has been a cornerstone of the University since it was founded in 1874. Today it encompasses a blend of cutting-edge research facilities and services, including the state-of-the-art Mathewson-IGT Knowledge Center (main library), Special Collections and University Archives, DeLaMare Science and Engineering Library, Jon Bilbao Basque Library, and mailto:@One Digital Media and Technology Center. The University Libraries fulfills its mission to further intellectual inquiry and innovation; partner with students and faculty in the creation of new knowledge; and foster excellence in education through providing access to scholarly resources, active learning environments, contemporary technology, and knowledgeable assistance, all with an underlying core focus on https://library.unr.edu/about/idea.\u003c/p\u003e\u003cp\u003eContact Information:\u003c/p\u003e\u003cp\u003eHeather Damonte at mailto:hdamonte@unr.edu\u003c/p\u003e\u003cp\u003eExempt\u003cbr /\u003eYes\u003c/p\u003e\u003cp\u003eFull-Time Equivalent\u003cbr /\u003e100.0%\u003c/p\u003e\u003cp\u003eRequired Attachment(s)\u003c/p\u003e\u003cp\u003ePlease note, once you submit your application the only attachment/s viewable to you will be the attachment/s to the resume/CV section of the application. Any additional required attachment/s to the cover letter, references, additional documents sections of the application, will not be viewable to you after you submit your application. All uploaded attachment/s will be on the application for the committee to review. To request updates to attachments, prior to the committee review of applications, please contact the candidate helpdesk at mailto:jobs@unr.edu.\u003c/p\u003e\u003cp\u003eAttach the following attachments to your application\u003c/p\u003e\u003cp\u003e1) Resume/CV\u003c/p\u003e\u003cp\u003e2) Cover Letter\u003c/p\u003e\u003cp\u003e3) Contact Information for Three Professional References\u003c/p\u003e\u003cp\u003e4) Please write a brief statement (one page maximum) about how you would contribute toward our mission of creating a culturally inclusive environment in the role for which you are applying.\u003c/p\u003e\u003cp\u003ePosting Close Time\u003c/p\u003e\u003cp\u003eThis posting will close at 12:00 am on the date listed below. The posting will no longer be available to apply to after 11:59 pm the day prior.\u003c/p\u003e\u003cp\u003ePosting Close Date\u003cbr /\u003e05/8/2023\u003c/p\u003e\u003cp\u003eNote to Applicant\u003c/p\u003e\u003cp\u003eA background check will be conducted on the candidate(s) selected for hire.\u003c/p\u003e\u003cp\u003eHR will attempt to verify academic credentials upon receipt of hiring documents. If the academic credentials cannot be verified, HR will notify the faculty member that an official transcript of their highest degree must be submitted within thirty days of the faculty member\u0026#39;s first day of employment.\u003c/p\u003e\u003cp\u003eReferences will be contacted at the appropriate phase of the recruitment process.\u003c/p\u003e\u003cp\u003eApplicants hired on a federal contract may be subject to E-Verify.\u003c/p\u003e\u003cp\u003eAs part of the hiring process, applicants for positions in the Nevada System of Higher Education may be required to demonstrate the ability to perform job-related tasks.\u003c/p\u003e\u003cp\u003eFor positions that require driving, evidence of a valid driver\u0026#39;s license will be required at the time of employment and as a condition of continued employment.\u003c/p\u003e\u003cp\u003eSchedules are subject to change based on organizational needs.\u003c/p\u003e\u003cp\u003eThe University of Nevada, Reno is committed to providing a place of work and learning free of discrimination on the basis of a person\u0026#39;s age (40 or older), disability, whether actual or perceived by others (including service-connected disabilities), gender (including pregnancy related conditions), military status or military obligations, sexual orientation, gender identity or expression, genetic information, national origin, race (including hair texture and protected hairstyles such as natural hairstyles, afros, bantu knots, curls, braids, locks and twists), color, or religion (protected classes).\u003c/p\u003e\u003cp\u003eAbout Us\u003c/p\u003e\u003cp\u003eThe University of Nevada, Reno is a public research university committed to the promise of a future powered by knowledge. Founded in 1874 as Nevada\u0026#39;s original land-grant university, the University serves 21,000 undergraduate and graduate students from all 50 states and 75 countries.\u003c/p\u003e\u003cp\u003eThe University is classified by the Carnegie\u0026reg; Classification of Institutions of Higher Education as an R1 university: A doctoral university with very high research activity. In 2020, the University was also recognized in the Carnegie\u0026reg; Community Engagement classification. The University is also ranked by U.S. News \u0026amp; World Report among the \u0026ldquo;Best Global Universities\u0026rdquo;, and it ranks in the top tier of the WSJ/Times Higher Education World University Rankings.\u003c/p\u003e\u003cp\u003eSince 2009, the University has invested more than $850 million in advanced labs, facilities, and residence halls. It is home to Nevada\u0026#39;s first medical school \u0026mdash; the University of Nevada, Reno School of Medicine \u0026mdash; and delivers on its original land-grant mission with outreach across the state through the University of Nevada, Reno Extension, Nevada Agricultural Experiment Station, Nevada Bureau of Mines and Geology, Nevada Small Business Development Center, the Nevada Seismological Laboratory, and Wolf Pack Athletics.\u003c/p\u003e\u003cp\u003eThe University\u0026#39;s main campus is in Reno, Nevada \u0026mdash; a burgeoning global technology hub with a vibrant Midtown and downtown. Located where the high desert of the Great Basin meets the High Sierra, the University\u0026#39;s beautiful, 290-acre main campus is also a Nevada State Arboretum. In recent years, the University has added two additional locations: the Redfield campus in south Reno and the Wayne L. Prim campus in Incline Village, the home of the University of Nevada, Reno at Lake Tahoe.\u003c/p\u003e\u003cp\u003eThe University is part of the Nevada System of Higher Education, which is comprised of two research universities, one state college, four community colleges and an environmental research institute, and is committed to developing strong partnerships with each institution for the benefit of all Nevadans.\u003c/p\u003e\u003cp\u003eThrough its commitment to high-impact education, world-improving research and creative activity, and outreach that\u0026#39;s transforming Nevada\u0026#39;s communities and businesses, the University continues its nearly 150-year tradition of benefitting our state, nation and world.\u003c/p\u003e\u003cp\u003eThe University recognizes that diversity promotes excellence in education and research. The inclusive and engaged community on campus recognizes the added value that students, faculty, and staff from different backgrounds bring to the educational experience.\u003c/p\u003e\u003cp\u003eToday, the University delivers on its original land-grant mission of access to education and knowledge by investing in the academics, facilities, support, engagement and vibrant campus life that promote our diverse students\u0026#39; cognitive growth and academic achievement \u0026mdash; all while remaining one of the best values in American higher education.\u003c/p\u003e\u003cp\u003eFor more information, please visit http://www.unr.edu/\u003cbr /\u003eUniversity of Nevada, Reno\u003c/p\u003e\u003cp\u003eTo apply, visit \u003ca href=\"https://apptrkr.com/4090347\"\u003ehttps://apptrkr.com/4090347\u003c/a\u003e\u003c/p\u003e\u003cp\u003eFounded in 1874, the University of Nevada, Reno is the State of Nevada\u0026rsquo;s land grant institution with a statewide mission and presence. The University of Nevada, Reno is a Carnegie I Research Institution and has been recognized as a \u0026ldquo;Top Tier\u0026rdquo; Best National University by U.S. News \u0026amp; World Report. With an enrollment of nearly 21,000 students we offer 145 Tier 1 accredited degree programs. Located in the picturesque Truckee Meadows the University of Nevada, Reno is surrounded by numerous state and national parks, is 45 minutes from beautiful Lake Tahoe, and four hours from San Francisco.\u003c/p\u003e\u003cp\u003eThe University of Nevada, Reno recognizes that diversity promotes excellence in education and research. We are an inclusive and engaged community and recognize the added value that students, faculty, and staff from different backgrounds bring to the educational experience.\u003c/p\u003e\u003cp\u003eThe Nevada System of Higher Education (NSHE) is committed to providing a place of work and learning free of discrimination on the basis of a person\u0026rsquo;s age, disability, whether actual or perceived by others (including service-connected disabilities), gender (including pregnancy related conditions), military status or military obligations, sexual orientation, gender identity or expression, genetic information, national origin, race, or religion.\u003c/p\u003e\u003cp\u003eCopyright \u0026copy;2022 Jobelephant.com Inc. All rights reserved.\u003c/p\u003e\u003cp\u003ehttps://www.jobelephant.com/\u003c/p\u003e",
                "job_type": "full_time",
                "telecommute": false,
                "location": "Reno, NV",
                "contact": "",
                "published": true,
                "created_at": "2023-04-17T15:44:56.629Z",
                "updated_at": "2023-04-20T16:52:09.785Z",
                "published_at": "2023-04-20T16:52:09.785Z"
            },
            "relationships": {
                "employer": {
                    "links": {
                        "self": "https://jobs.code4lib.org/employers/university-of-nevada-reno"
                    },
                    "data": {
                        "id": 29,
                        "name": "University of Nevada, Reno"
                    }
                }
            },
            "links": {
                "self": "https://jobs.code4lib.org/jobs/57102-community-and-university-archivist"
            }
        },
        {
            "id": 57101,
            "attributes": {
                "title": "Metadata Librarian",
                "origin": "https://jobs.code4lib.org/jobs",
                "url": "https://jobs.shu.edu/en-us/job/495710/metadata-librarian",
                "description": "\u003cp\u003e\u003cstrong\u003eJob no:\u003c/strong\u003e\u0026nbsp;495710\u003cbr /\u003e\u003cstrong\u003eFull time/Part time:\u003c/strong\u003e\u0026nbsp;Full-time\u003cbr /\u003e\u003cstrong\u003eLocation:\u003c/strong\u003e\u0026nbsp;South Orange\u003cbr /\u003e\u003cstrong\u003eCategories:\u003c/strong\u003e\u0026nbsp;Faculty\u003c/p\u003e\u003cp\u003eThe successful candidate will oversee and manage all aspects of the full life cycle of print and electronic library resources to ensure accurate representation on the shelves and in integrated library and archival systems. In addition, the Metadata Librarian will have outstanding communication and organizational skills to build and maintain collaborative working relationships with colleagues. Working closely with the Assistant Dean of Information Technology and Collection Services, Electronic Resources Librarian, and Acquisitions Librarian, the incumbent will oversee and manage all aspects of metadata and deliver a seamless experience to users regarding the access and discovery of library resources and services. This position will play an integral role in working cooperatively with units across the library to develop workflows and services that enhance access to our rich print, digital, and electronic collections. This is a tenure track position; an additional graduate degree, scholarship, and service are required for consideration for tenure.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eDuties and Responsibilities:\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e●Oversee and provide leadership for cataloging, metadata management, and discovery services procedures and strategic initiatives across various platforms.\u003cbr /\u003e●Perform original and copy cataloging for MARC records on an as needed basis; participate in special cataloging projects as needed to improve the findability of materials.\u003cbr /\u003e● Direct bibliographic and authority maintenance activities, ensuring search quality and accuracy.\u003cbr /\u003e● Evaluate electronic data in a variety of formats for resource discovery; and keep current with issues and trends in cataloging and\u003cbr /\u003eresource discovery.\u003cbr /\u003e● Assist with automating and integrating workflows for metadata creation and related processes (such as reformatting and digitization).\u003cbr /\u003e● Collaborate with Collection Services Librarians, the Special Collections and the Gallery, to transform or \u0026ldquo;crosswalk\u0026rdquo; metadata using\u003cbr /\u003estandard tools and scripts.\u003cbr /\u003e● Develop and maintain positive, collaborative relationships with staff across the Library and with external partners, as appropriate, to\u003cbr /\u003efoster improved metadata practices.\u003cbr /\u003e● Chair the Discovery committee to provide opportunities for teaching/reference faculty to help direct this process.\u003cbr /\u003e● Oversee the Electronic Theses and Dissertation (ETDs) workflows. Provide oversight to staff assigned to assist with ETDs.\u003cbr /\u003e● Supervise staff assigned to specific metadata/cataloging projects and student library assistants.\u003cbr /\u003e● Participate in teaching and reference as needs arise.\u003cbr /\u003e● Other duties as assigned.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eRequired Qualifications:\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e● Master\u0026rsquo;s degree in Library and Information Science from an ALA accredited degree program. Second master\u0026rsquo;s degree, scholarly\u003cbr /\u003eactivity and service will be required for tenure.\u003cbr /\u003e● Minimum 1-3 years\u0026rsquo; experience working with metadata.\u003cbr /\u003e● Knowledge of MARC, AACR2, RDA, Dublin Core, MODS, EAD and RDF/BIBFRAME.\u003cbr /\u003e● Experience working with institutional repository software such as Digital Commons.\u003cbr /\u003e● Demonstrated commitment to diversity and inclusion specifically as it pertains to cataloging/metadata work.\u003cbr /\u003e● Ability to communicate effectively: verbally, writing, and listening.\u003cbr /\u003e● Some supervisory or training experience.\u003cbr /\u003e● Excellent interpersonal, analytical, organizational, problem-solving, time management, and communication skills.\u003cbr /\u003e● Ability to produce accurate statistics and reports.\u003cbr /\u003e● Commitment to supporting the Mission of the University and servant leadership.\u003cbr /\u003e\u0026nbsp;\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eDesired Qualifications:\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e● Experience using MarcEdit, OpenRefine and/or Python.\u003cbr /\u003e● Basic understanding of licensing and copyright issues.\u003cbr /\u003e● Experience with Tableau or PowerBI.\u003cbr /\u003e● Experience cataloging materials for special collections.\u003cbr /\u003e● Reading knowledge of a second language.\u003cbr /\u003e● Experience with data management and data curation practices.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eLicenses and Certificates:\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u0026nbsp;\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eSalary Grade:\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eFA01 - Faculty\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eExempt/Nonexempt:\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eExempt\u003c/p\u003e\u003cp\u003e\u003cstrong\u003ePhysical Demands:\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eGeneral Office Environment\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eSpecial Instructions to Applicants:\u003c/strong\u003e\u003c/p\u003e\u003cp\u003ePlease include contact information for 3 professional references.\u003c/p\u003e\u003cp\u003e\u003cem\u003eSeton Hall University is committed to programs of Equal Employment Opportunity (EEO) and the principles of affirmative action.\u003c/em\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eAdvertised:\u003c/strong\u003e\u0026nbsp;05 Apr 2023\u0026nbsp;Eastern Daylight Time\u003c/p\u003e",
                "job_type": "full_time",
                "telecommute": false,
                "location": "South Orange, NJ",
                "contact": "sharon.ince@shu.edu",
                "published": true,
                "created_at": "2023-04-17T14:28:17.384Z",
                "updated_at": "2023-04-20T16:52:06.310Z",
                "published_at": "2023-04-20T16:52:06.309Z"
            },
            "relationships": {
                "employer": {
                    "links": {
                        "self": "https://jobs.code4lib.org/employers/seton-hall-university-libraries"
                    },
                    "data": {
                        "id": 144,
                        "name": "Seton Hall University Libraries"
                    }
                }
            },
            "links": {
                "self": "https://jobs.code4lib.org/jobs/57101-metadata-librarian"
            }
        }
    ]
}
